[
  {
    "movieID": 3566,
    "movieTitle": "28 Days Later",
    "poster": "https://images-us-az.crackle.com/profiles/channels/3566/OneSheetImage_800x1200.jpg?ts=20180611164401",
    "mediaID": 2505101,
    "synopsis": "Animal rights activists free a group of infected chimpanzees to horrifying results in this speculative sci-fi horror effort from Trainspotting director Danny Boyle. Waking from a coma in a deserted London hospital 28 days later, bicycle courier Jim (Cillian Murphy) takes to the deserted city streets in a state of mystified confusion. Joining forces with another group of survivors following a terrifying encounter in a seemingly abandoned church, Jim soon learns the truth behind the deserted streets and the menacing creatures that lurk in the shadows. It's soon revealed that the chimpanzees had been harboring a deadly virus that sends its victims into a furious, murderous rage, and in the days following the initial exposure, the entire population was nearly wiped out due to the resulting homicidal rampage. Is there still a glimmer of hope for humanity -- or has the deadly \"rage\" virus found its way to foreign shores and infected the entire planet?"
  },
  {
    "movieID": 3133,
    "movieTitle": "30 Minutes Or Less",
    "poster": "https://images-us-az.crackle.com/profiles/channels/3133/OneSheetImage_800x1200.jpg?ts=20161031134346",
    "mediaID": 2500469,
    "synopsis": "<p>In the action-comedy 30 Minutes or Less, Nick (Jesse Eisenberg) is a small town pizza delivery guy whose mundane life collides with the big plans of two wanna-be criminal masterminds (Danny McBride and Nick Swardson). The volatile duo kidnaps Nick and forces him to rob a bank. With mere hours to pull off the impossible task, Nick enlists the help of his ex-best friend, Chet (Aziz Ansari). As the clock ticks, the two must deal with the police, hired assassins, flamethrowers, and their own tumultuous relationship.</p>"
  },
  {
    "movieID": 2415,
    "movieTitle": "50 First Dates",
    "poster": "https://images-us-az.crackle.com/profiles/channels/2415/OneSheetImage_800x1200.jpg?ts=20180119092332",
    "mediaID": 2493080,
    "synopsis": "<p>A man falls in love with a woman who suffers from severe short-term memory loss.</p>"
  },
  {
    "movieID": 1304,
    "movieTitle": "The 6th Day",
    "poster": "https://images-us-az.crackle.com/profiles/channels/1304/OneSheetImage_800x1200.jpg?ts=20170130170747",
    "mediaID": 2486390,
    "synopsis": "In this futuristic thriller spiked with intrigue, humor and high-voltage action, a ruthless power broker is using his advanced genetic-engineering technology to clone human beings for personal gain. When Adam Gibson (Arnold Schwarzenegger), an old-fashioned family man and decorated fighter pilot in what was known as the Rainforest War, comes home one night to discover that his life has been stolen by his clone, his perfect existence is erased. Plunged into a sinister world of murder, corruption and high-tech deception, he is torn from his family by thugs who have been sent to destroy him because they cloned the wrong man. Adam must not only save himself, but uncover who and what is behind the evil plot that entangles him in order to reclaim his family and his identity."
  },
  {
    "movieID": 3595,
    "movieTitle": "Action Figures",
    "poster": "https://images-us-az.crackle.com/profiles/channels/3595/OneSheetImage_800x1200.jpg?ts=20180510094314",
    "mediaID": 2505623,
    "synopsis": "<p>Action Figures is the directorial debut of Travis Pastrana, Nitro Circus founder and 17-time X Game medalist, a film he wrote, directed, and produced alongside his best friends from the world of action sports and in association with&nbsp;Nitro Circus.&nbsp; It is a first of a kind film by these modern day action heroes in which each athlete contributed to filming and editing their section of the film.&nbsp; Action Figures is an energy packed, high octane, wild ride of a film that is both an ode to the old school action sports videos and a bold step forward in filmmaking and extreme human performance.&nbsp; This is Travis Pastrana&rsquo;s personal passion project in which he makes the dream stunts of his close friends become reality.&nbsp; It is one crazy ride with Travis at the wheel as his friends achieve multiple worlds&rsquo; firsts along the way. &nbsp;These real life Action Figures will push their bodies and minds to conquer the impossible and ignite action sports entertainment.</p>"
  },
  {
    "movieID": 3612,
    "movieTitle": "Action Figures 2",
    "poster": "https://images-us-az.crackle.com/profiles/channels/3612/OneSheetImage_800x1200.jpg?ts=20180626163515",
    "mediaID": 2505856,
    "synopsis": "<p>Action Figures 2 is the sequel to Travis Pastrana&rsquo;s hit action-sports movie, Action Figures. The Nitro Circus founder and 17-time X Games medalist does it again with a film he directed and produced alongside his best friends, and in association with Nitro Circus. Travis leaves nothing on the table for this sequel and pushes boundaries even further for this action-packed film. The cast are real-life action figures and have all contributed to filming and editing their sections of the film. Action Figures 2 is a fun-fueled, high-octane, wild ride of a film. It&rsquo;s both a throwback to old-school action sports videos and a bold step forward in filmmaking and extreme human performance. Action Figures 2 embodies Travis&rsquo; drive to push the limits on the impossible and allows his friends to make their dream stunts a reality. This is one crazy ride with Travis at the wheel as his friends achieve multiple worlds&rsquo; firsts along the way. These real-life action figures will send it bigger, farther and faster than ever before to conquer the impossible and ignite action sports entertainment.</p>"
  },
  {
    "movieID": 3580,
    "movieTitle": "Age Of Kill",
    "poster": "https://images-us-az.crackle.com/profiles/channels/3580/OneSheetImage_800x1200.jpg?ts=20180621085335",
    "mediaID": 2505699,
    "synopsis": "<p>A black ops sniper is blackmailed by a psychotic international terrorist into killing 6 unrelated people in 6 hours... but there is more to the victims than meets the eye.</p>"
  },
  {
    "movieID": 2379,
    "movieTitle": "Ali G Indahouse",
    "poster": "https://images-us-az.crackle.com/profiles/channels/2379/OneSheetImage_800x1200.jpg?ts=20170111163704",
    "mediaID": 2492791,
    "synopsis": "<p>Ali G (Sacha Baron Cohen), stars in his side-splitting, outrageously funny feature film debut - Ali G Indahouse! The hip-hopping, white gangsta-rapper wannabe gets entangled in the evil Chancellor&#39;s plot to overthrow the Prime Minister of Great Britain (Michael Gambon, Harry Potter and the Prisoner of Azkaban). But, instead of bringing him down, Ali G is embraced by the nation as the voice of youth and &quot;realness,&quot; making the Prime Minister and his government more popular than ever.</p>"
  },
  {
    "movieID": 3604,
    "movieTitle": "An Officer And A Gentleman",
    "poster": "https://images-us-az.crackle.com/profiles/channels/3604/OneSheetImage_800x1200.jpg?ts=20180615153113",
    "mediaID": 2505703,
    "synopsis": "Loner Zack Mayo (Richard Gere) enters Officer Candidate School to become a Navy pilot and in thirteen torturous weeks he learns the importance of discipline, love and friendship."
  },
  {
    "movieID": 633,
    "movieTitle": "Angel Of Death",
    "poster": "https://images-us-az.crackle.com/profiles/channels/633/OneSheetImage_800x1200.jpg?ts=20180524114017",
    "mediaID": 2479948,
    "synopsis": "<p>In the tradition of Grindhouse, Kill Bill and Sin City, award-winning comic book writer Ed Brubaker (Incognito, The Death of Captain America, Daredevil) teams up with stuntwoman-turned-cult-star Zo&euml; Bell (Death Proof, Lost) to deliver a stark, stylish pulp thriller about a very bad girl gone &quot;good.&quot; Eve (Bell) is a sexy assassin who kills without remorse, until one botched hit changes everything. Caught off guard, Eve is stabbed in the head and inadvertently murders a young girl. The blade is removed, but the damage is done: Eve&#39;s mind is now filled with visions of past victims. The hunter becomes the haunted and this killing machine is plagued with remorse. Unable to &quot;work,&quot; this mob asset has become a liability. Eve&#39;s only chance to survive is to track down her ruthless bosses before their new hitman finds her. Also stars Lucy Lawless (Xena: Warrior Princess, Bedtime Stories, Battlestar Galactica), Doug Jones (Quarantine) and Ted Raimi (Spider Man 3).</p>"
  },
  {
    "movieID": 2141,
    "movieTitle": "Arena",
    "poster": "https://images-us-az.crackle.com/profiles/channels/2141/OneSheetImage_800x1200.jpg?ts=20170130163333",
    "mediaID": 2490088,
    "synopsis": "How do you make a fortune from the bloodlust of millions?  One sadistically savvy businessman (Samuel L. Jackson) has created an empire with his brutal, fight-to-the-death gladiator website.  His newest warrior is David Lord (Kellan Lutz), a kidnapped fireman, now imprisoned and forced to fight for his life. To buy his freedom, Lord agrees to do a series of lethal bouts.  But as the body count escalates, and with his most challenging battle remaining, Lord unleashes a torrent of bloody carnage and reveals a secret that threatens to tear down the entire enterprise. Also featuring Daniel Dae Kim (TV's \"Lost\") and Nina Dobrev (TV's \"Vampire Diaries\")."
  },
  {
    "movieID": 3322,
    "movieTitle": "The Art Of War",
    "poster": "https://images-us-az.crackle.com/profiles/channels/3322/OneSheetImage_800x1200.jpg?ts=20170622150708",
    "mediaID": 2502526,
    "synopsis": "Shaw is an operative for the United Nations' covert dirty-tricks squad, using espionage and quasi-ethical tactics to secure peace and cooperation. When a shipping container full of dead Vietnamese refugees turns up on the docks and China's ambassador is gunned down at a dinner celebrating a new trade agreement with China and the US, Shaw is framed for the murder and must evade the FBI and Triad gangsters to find out what is really going on."
  },
  {
    "movieID": 2633,
    "movieTitle": "Avengers Confidential: Black Widow & Punisher",
    "poster": "https://images-us-az.crackle.com/profiles/channels/2633/OneSheetImage_800x1200.jpg?ts=20170130163519",
    "mediaID": 2494872,
    "synopsis": "After interfering with a top secret mission, THE PUNISHER is taken into custody by S.H.I.E.L.D. AGENT and AVENGER, BLACK WIDOW. At the orders of Director Nick Fury, Punisher and Black Widow are sent on a mission to stop LEVIATHAN, a global terrorist organization, that plans to sell stolen S.H.I.E.L.D. technology to the highest bidder. Now, the vigilante and spy must work together to prevent this technology from falling into the wrong hands. The fate of the world, and of the AVENGERS, hangs in the balance."
  },
  {
    "movieID": 1176,
    "movieTitle": "Backwash",
    "poster": "https://images-us-az.crackle.com/profiles/channels/1176/OneSheetImage_800x1200.jpg?ts=20180524114454",
    "mediaID": 2484617,
    "synopsis": "<p>Three eccentric losers (Josh Malina, Michael Panes and Michael Ian Black) inadvertently rob a bank armed only with a salami in a sweat sock and go on the lam in an ice cream truck. With echoes of the Marx Brothers and Monty Python, Backwash is a slapstick look at the effects of sudden wealth on three American losers.This manic comedy is executive produced by Danny Leiner, director of Harold &amp; Kumar Go to White Castle and Dude Where&rsquo;s My Car?. Guest cameos include Jon Hamm, John Stamos, Sarah Silverman, John Cho, Allison Janney, Hank Azaria, Michael Vartan, Steven Weber, Jamie-Lynn Sigler and more.</p>"
  },
  {
    "movieID": 810,
    "movieTitle": "The Bannen Way",
    "poster": "https://images-us-az.crackle.com/profiles/channels/810/OneSheetImage_800x1200.jpg?ts=20180524115436",
    "mediaID": 2481263,
    "synopsis": "<p>Charming con man Neal Bannen (Mark Gannt, Ocean&#39;s Eleven) wants to leave the criminal lifestyle for the straight and narrow. But he&#39;s got a few problems: a mob boss for an uncle (Robert Forster, Jackie Brown, Lucky Number Slevin), a police chief for a father (Michael Ironside, Top Gun, Starship Troopers) and a serious gambling debt. In order to break free, he must accept one more job working for his uncle, while plotting his way out of the life he&#39;s always known.</p>"
  },
  {
    "movieID": 3593,
    "movieTitle": "Batman: The Killing Joke",
    "poster": "https://images-us-az.crackle.com/profiles/channels/3593/OneSheetImage_800x1200.jpg?ts=20180615152617",
    "mediaID": 2505706,
    "synopsis": "Based on Alan Moore's 1988 graphic novel of the same name, Batman: The Killing Joke traces the rise of the Joker from his early days as a struggling stand-up comic to his eventual evolution into the Clown Prince of Crime after a fateful encounter with Batman that changes both of their lives. Batman hunts for the escaped Joker, who terrorizes Commissioner Gordon and Barbara Gordon to prove a diabolical point mirroring his own fall into madness."
  },
  {
    "movieID": 3492,
    "movieTitle": "Black Jack: The Movie",
    "poster": "https://images-us-az.crackle.com/profiles/channels/3492/OneSheetImage_800x1200.jpg?ts=20180119090424",
    "mediaID": 2504856,
    "synopsis": "Black Jack is a master surgeon who possesses impeccable skills, enabling him to perform operations that are impossible for even the finest surgeons. He is a man alone and full of mystery, appearing in operating rooms to fulfill his tasks, while charging millions for his secret operations. He now is faced with his most difficult task to date and must challenge the limits of medical science... before it's too late! An extraordinary number of intellectual and athletic \"Superhumans\" have the world caught in awe, wonder, and excitement. These \"Superhumans\" far exceed the framework of common sense and possess the ability to outperform all of their rivals... but how did they get this way? Black Jack discovers the truth behind this unusual occurrence… a hideous conspiracy lurking behind this strange genetic phenomenon…. and a dark secret that is about to endanger the existence of all mankind."
  },
  {
    "movieID": 1386,
    "movieTitle": "Blood: The Last Vampire",
    "poster": "https://images-us-az.crackle.com/profiles/channels/1386/OneSheetImage_800x1200.jpg?ts=20170301182254",
    "mediaID": 2486845,
    "synopsis": "<p>Yakota Air Force Base, an American military compound in Japan, has been invaded by a league of shape-shifting vampires known as Chiropterans. It&#39;s up to Saya, a grim woman of mysterious origin, and her magic sword to rid the base, and the planet, of these unwelcome and menacing monsters</p>"
  },
  {
    "movieID": 546,
    "movieTitle": "Bram Stoker’s Dracula",
    "poster": "https://images-us-az.crackle.com/profiles/channels/546/OneSheetImage_800x1200.jpg?ts=20170112101621",
    "mediaID": 2479739,
    "synopsis": "Based on Bram Stoker's classic and dark love story about the vampire who travels from Eastern Europe to England in search of human love."
  },
  {
    "movieID": 1266,
    "movieTitle": "Bucky Larson: Born To Be A Star",
    "poster": "https://images-us-az.crackle.com/profiles/channels/1266/OneSheetImage_800x1200.jpg?ts=20141222113555",
    "mediaID": 2494376,
    "synopsis": "A kid from the Midwest moves out to Hollywood in order to follow in his parents footsteps -- and become a porn star."
  },
  {
    "movieID": 1116,
    "movieTitle": "Bugsy",
    "poster": "https://images-us-az.crackle.com/profiles/channels/1116/OneSheetImage_800x1200.jpg?ts=20170112101729",
    "mediaID": 2485259,
    "synopsis": "A charismatic gangster and his starlet mistress join forces to create his vision of what we now know as Las Vegas."
  },
  {
    "movieID": 2897,
    "movieTitle": "Buried Alive",
    "poster": "https://images-us-az.crackle.com/profiles/channels/2897/OneSheetImage_800x1200.jpg?ts=20170111164834",
    "mediaID": 2493415,
    "synopsis": "<p>A group of young people wake up to find themselves each encased in a custom-made coffin. To escape their confinement, each must uncover their connections to each other and the reason for their current nightmare&mdash;or die trying.</p>"
  },
  {
    "movieID": 1033,
    "movieTitle": "Cadillac Records",
    "poster": "https://images-us-az.crackle.com/profiles/channels/1033/OneSheetImage_800x1200.jpg?ts=20170130163949",
    "mediaID": 2483337,
    "synopsis": "<p>In this tale of sex, violence, race and rock n&rsquo; roll in 1950s Chicago, director Darnell Martin chronicles the rise of Chess Records, founded by Leonard Chess, and its slate of recording artists who left an indelible mark on popular music. The blues revival and its influence on the rock music explosion that takes over the world is viewed through the exciting but turbulent lives of America&rsquo;s musical legends, including Etta James, Muddy Waters, Howlin&rsquo; Wolf and Chuck Berry.</p>"
  },
  {
    "movieID": 2356,
    "movieTitle": "Colombiana",
    "poster": "https://images-us-az.crackle.com/profiles/channels/2356/OneSheetImage_800x1200.jpg?ts=20180514113200",
    "mediaID": 2491715,
    "synopsis": "A young woman grows up to be a stone-cold assassin after witnessing her parents' murder as a child in Bogota. She works for her uncle as a hitman by day, but her personal time is spent engaging in vigilante murders that she hopes will lead her to her ultimate target - the mobster responsible for her parents' death."
  },
  {
    "movieID": 1563,
    "movieTitle": "Conspiracy",
    "poster": "https://images-us-az.crackle.com/profiles/channels/1563/OneSheetImage_800x1200.jpg?ts=20130116191230",
    "mediaID": 2488491,
    "synopsis": "William \"Spooky\" Macpherson is a thirty six year old veteran of the Iraq war. Known as the man with the thousand yard stare he is not only a soldier but a warrior. One day he receives a call from fellow veteran and friend Miguel Silva; a man who saved Macpherson's life during his tour in the middle east and is now asking for help. Finding civilian life a bore and a chore Macpherson obliges and journeys to Lukeville, Arizona to help his friend get his newly acquired ranch into shape. But when Macpherson arrives Silva has gone missing. While searching for his friend Macpherson soon realizes that the townspeople of Lukeville are living in fear of the notorious John Rhodes; a man who has taken control of the town for personal gain. When Macpherson finds out that Silva has been killed as part of Rhodes overall strategy nothing stops Macpherson in his quest for justice."
  },
  {
    "movieID": 1037,
    "movieTitle": "The Contractor",
    "poster": "https://images-us-az.crackle.com/profiles/channels/1037/OneSheetImage_800x1200.jpg?ts=20170130171110",
    "mediaID": 2483338,
    "synopsis": "<p>Wesley Snipes plays an ex-assassin that&#39;s pursued throughout London after being set up by his old bosses in this action thriller. Former sniper James Dial (Snipes) has been carrying around the ghosts of his last botched job ever since he failed to kill the leader of a worldwide terrorist group. After leaving the business and shacking up in Montana, Dial is wooed back when he&#39;s offered the chance to make good on his failure when word gets out that the British government are holding the same terrorist in captivity. What Dial doesn&#39;t know is that he&#39;ll soon be framed for murder, putting him on the run in the underbelly of London with the British polish hot on his heels. Alone and unsure of whom to trust, his only ally is a 12-year old girl that aides him as they hunt down proof of his innocence.</p>"
  },
  {
    "movieID": 3581,
    "movieTitle": "Cosmopolis",
    "poster": "https://images-us-az.crackle.com/profiles/channels/3581/OneSheetImage_800x1200.jpg?ts=20180628083301",
    "mediaID": 2505708,
    "synopsis": "From director David Cronenberg (A HISTORY OF VIOLENCE, DEAD RINGERS, THE FLY, EASTERN PROMISES) and based on the prophetic novel by Don DeLillo, comes COSMOPOLIS, a contemporary thriller that turns into a wild, hypnotic odyssey through our new millennium's obsessions with power, money, control, information, technology, violence, sex, mortality, revolution, destruction and ultimately, redemption. Unfolding in a single cataclysmic day, the story follows Eric Packer (Robert Pattinson) a 28-year old financial whiz kid and billionaire asset manager as he heads out in his tricked-out stretch limo to get a haircut from his father's old barber, while remotely wagering his company's massive fortune on a bet against the Chinese Yuan. Packer's luxe trip across the city quickly becomes dizzyingly hellish as he encounters explosive city riots, a parade of provocative visitors, and is thrust into a myriad of intimate encounters. Having started the day with everything, believing he is the future, Packer's perfectly ordered, doubt-free world is about to implode. Produced by Paulo Branco and Martin Katz, COSMOPOLIS also stars Juliette Binoche, Sarah Gadon, Mathieu Amalric, Jay Baruchel, Kevin Durand, K'Naan, Emily Hampshire with Samantha Morton and Paul Giamatti."
  },
  {
    "movieID": 1102,
    "movieTitle": "The Cottage",
    "poster": "https://images-us-az.crackle.com/profiles/channels/1102/OneSheetImage_800x1200.jpg?ts=20180611164019",
    "mediaID": 2483855,
    "synopsis": "Forced into hiding after their kidnapping plan goes awry, two rival siblings, David (Andy Serkis - The Lord of the Rings trilogy) and Peter (Reece Shearsmith - Shaun of the Dead), find themselves fighting for their sanity while they hole up in a secluded country cottage. Weighed down by a hostage who refuses to stay quiet, or tied down, they are soon held captive by their own victim. But everyone's problems go from bad to worse when they come face-to-face with their psychotic axe-wielding neighbor."
  },
  {
    "movieID": 3551,
    "movieTitle": "Daredevil",
    "poster": "https://images-us-az.crackle.com/profiles/channels/3551/OneSheetImage_800x1200.jpg?ts=20180611164229",
    "mediaID": 2505110,
    "synopsis": "One of Marvel Comics' most popular characters comes to the screen for the first time in this sci-fi action-thriller. Matthew Murdock (Ben Affleck) is a lawyer whose father, a prizefighter, was killed by gangsters when Murdock was just a boy. Since then, Murdock has devoted his life to bringing wrongdoers to justice and is willing to help others by taking on cases no other attorney will touch. Murdock is also blind, after being struck down by a truck while trying to save a man from being hit. What no one knows is that Murdock was also doused with an unusual radioactive isotope which had a strange effect on him -- while Murdock's sight may be gone, his other senses have been raised to such a keen pitch that they act like radar, allowing him to tell where he's going and what happens around him, both near and far away. Murdock puts his gifts to use at night as the costumed crime-fighter Daredevil, whose pursuit of justice has earned him the wrath of underworld leader Kingpin (Michael Clarke Duncan). Kingpin wants Daredevil out of his way once and for all, and hires Bullseye (Colin Farrell), a super-assassin with an uncanny ability to throw blades, to do the job. Daredevil also makes the acquaintance of Elektra Natchios (Jennifer Garner), a woman with super-heroic talents who is also on Kingpin's bad side, though it remains to be seen if she has aligned herself with the forces of good as Daredevil has done. Jon Favreau, Joe Pantoliano, and David Keith highlight Daredevil's supporting cast."
  },
  {
    "movieID": 2968,
    "movieTitle": "Dead Rising: Endgame",
    "poster": "https://images-us-az.crackle.com/profiles/channels/2968/OneSheetImage_800x1200.jpg?ts=20180524115707",
    "mediaID": 2498761,
    "synopsis": "<p>The Sony Crackle Original movie&nbsp;Dead Rising: Endgame&nbsp;is based on the worldwide smash-hit video game series&nbsp;Dead Rising&nbsp;from Capcom, the iconic studio that created&nbsp;Resident Evil,&nbsp;and Legendary, the team that brought you&nbsp;Jurassic World,&nbsp;Godzilla,&nbsp;The Dark Knight Rises&nbsp;and more.&nbsp;Jesse Metcalfe (Dallas,&nbsp;Desperate Housewives) is Chase Carter, an investigative journalist haunted by his past and now hunted by the military. After narrowly escaping a zombie quarantine, Chase can&rsquo;t shake the guilt of having left a trusted colleague behind. Now, as he heads back into the quarantine to expose the architects of the outbreak, he will uncover a secret more evil than he could have imagined. Guarding this secret is General Lyons (Dennis Haysbert,&nbsp;The Unit,&nbsp;24), a ruthless military officer determined to silence anyone who threatens the government&rsquo;s fatal plans. With mass annihilation looming, Chase&mdash;along with a group of dubious allies&mdash;slices, hacks and bludgeons his way through the zombie hordes that plague every corner of the abandoned city. As zero hour approaches, our heroes will have to confront their most gruesome nightmares in order to save millions of innocent lives, including their own. Also stars Billy Zane (Titanic,&nbsp;Back to the Future), Marie Avgeropoulos (The 100), Keegan Connor Tracy (Final Destination 2, Chaos) and Patrick Sabongui (300,&nbsp;Godzilla).</p>"
  },
  {
    "movieID": 2237,
    "movieTitle": "The Detonator",
    "poster": "https://images-us-az.crackle.com/profiles/channels/2237/OneSheetImage_800x1200.jpg?ts=20131021114254",
    "mediaID": 2490889,
    "synopsis": "<p>Homeland Security agent attempts to prevent an international arms dealer from setting off a bio-weapon on US soil.</p>"
  },
  {
    "movieID": 690,
    "movieTitle": "Devil In A Blue Dress",
    "poster": "https://images-us-az.crackle.com/profiles/channels/690/OneSheetImage_800x1200.jpg?ts=20170301183636",
    "mediaID": 2480647,
    "synopsis": "It's 1948  and LA is booming  but Easy Rawlins has just been fired and he's got house payments to make. When he's offered a job locating Daphne Monet he takes it but soon finds himself drawn into a we"
  },
  {
    "movieID": 3611,
    "movieTitle": "Easy A",
    "poster": "https://images-us-az.crackle.com/profiles/channels/3611/OneSheetImage_800x1200.jpg?ts=20180611164625",
    "mediaID": 2505709,
    "synopsis": "In this charming, critically acclaimed tale of rumors and reputation, Olive (Emma Stone), an average high school student, sees her below-the-radar existence turn around overnight once she decides to use the school's gossip grapevine to advance her social standing.  Now her classmates (Amanda Bynes, Aly Michalka) are turning against her and the school board is becoming concerned, including her favorite teacher (Thomas Haden Church) and the distracted guidance counselor (Lisa Kudrow). With the support of her hilariously idiosyncratic parents (Stanley Tucci, Patricia Clarkson) and a little help from a long-time crush (Penn Badgley), Olive attempts to take on her notorious new identity and crush the rumor mill once and for all."
  },
  {
    "movieID": 3241,
    "movieTitle": "Elektra",
    "poster": "https://images-us-az.crackle.com/profiles/channels/3241/OneSheetImage_800x1200.jpg?ts=20170327124230",
    "mediaID": 2502233,
    "synopsis": "Daredevil's main squeeze gets resurrected in her own flick with this spin-off martial arts actioner from director Rob Bowman (Reign of Fire, The X-Files: Fight the Future). Jennifer Garner returns to the role of Elektra Natchios, a hired assassin whose origins are finally revealed after her old ninja clan the Hand brings her back from the dead to serve their evil purposes. Reunited with her old sensei, Stick (Terence Stamp), Elektra leaves the past behind her and is eventually given an assignment to kill Mark Miller (Goran Visnjic) and his daughter, Abby (Kristin Prout). When her conscience gets the best of her and she decides to protect them instead, it's up to the Hand's top assassins to track her down and finish the job. Fans of Marvel Comics might recognize Natassia Malthe as Typhoid Mary, another nemesis of Daredevil that joins in the hunt, along with other masters of the dark mystic arts, Tattoo (Chris Ackerman), Stone (Bob Sapp), and the Hand's fearsome leader, Kirigi (Will Yun Lee)."
  },
  {
    "movieID": 1451,
    "movieTitle": "Elektra Luxx",
    "poster": "https://images-us-az.crackle.com/profiles/channels/1451/OneSheetImage_800x1200.jpg?ts=20170331155441",
    "mediaID": 2487580,
    "synopsis": "Recently retired from the adult film industry, superstar Elektra Luxx (Carla Gugino) is pregnant with the child of late rock star Nick Chapel. She is trying to make ends meet by teaching a community college sex education class aimed at housewives when a figure from her past, flight attendant Cora (Marley Shelton), approaches her with a proposition. In exchange for the (stolen) lyrics to Nick Chapel's last record, all of which is about Elektra, Cora needs Elektra to seduce her fiancée. Elektra reluctantly agrees to do this favor, setting in motion a series of hilarious events which will see her come face to face with detectives, sex bloggers, emotionally unstable neighbors and the Virgin Mary herself as she wrestles with the prospect of motherhood and tries to become a person of substance."
  },
  {
    "movieID": 2074,
    "movieTitle": "Extraction",
    "poster": "https://images-us-az.crackle.com/profiles/channels/2074/OneSheetImage_800x1200.jpg?ts=20170111165735",
    "mediaID": 2490482,
    "synopsis": "<p>Extraction follows a U.S. Black Ops team member who finds himself the only survivor of a botched prisoner extraction mission. Forced to fight his way out of a maximum-security Chechen prison, he must keep his target alive in order to catch a terrorist arms dealer who is a threat to thousands of lives. Extraction stars Danny Glover (Lethal Weapon, The Color Purple), Vinnie Jones (Snatch), Sean Astin (The Lord of the Rings, Rudy), John Foo (Tekken), Joanne Kelly (Warehouse 13) and Falk Hentschel (Knight and Day). The movie is written and directed byTony Giglio (Chaos, In Enemy Hands), and produced by Ranger 7 Films, founded by executive producers Mike Callaghan, Reuben Liber and Justin Bursch.</p>"
  },
  {
    "movieID": 3494,
    "movieTitle": "Fist Of The North Star",
    "poster": "https://images-us-az.crackle.com/profiles/channels/3494/OneSheetImage_800x1200.jpg?ts=20180125123100",
    "mediaID": 2504857,
    "synopsis": "In the near future, Earth has been devastated by a nuclear hell. In these troubled times, kinetic martial arts have replaced weapons of mass destruction, and the legendary Fist of the North Star style may then be the only hope for humanity's survival. Ken, the rightful master of Fist of the North Star, is forced to fight old friends gone mad, wicked new enemies, and even comes face to face with his power hungry elder brothers. All this in the hope that he will someday be reunited with his beloved Julia."
  },
  {
    "movieID": 204,
    "movieTitle": "Flatliners",
    "poster": "https://images-us-az.crackle.com/profiles/channels/204/OneSheetImage_800x1200.jpg?ts=20170112102601",
    "mediaID": 2402711,
    "synopsis": "<p>Five ambitious medical students embark on a daring and arrogant experiment: to push through the confines of life and touch the face of death. To help him venture into this realm, manipulative and ambitious Nelson Wright (Kiefer Sutherland) has recruited a self-made death expert (Julia Roberts), an idealistic former med student (Kevin Bacon), a ladies-man (William Baldwin), and their brilliant but self-absorbed documentarian (Oliver Platt). They take turns stopping their hearts until the monitors reading their vital signs indicate nothing but flat lines. Moments later, the other team members step in to revive them. They soon find, however, that they don&#39;t return alone from their peek at the afterlife; they bring back with them manifestations of their past transgressions, forcing them to deal with their past in the present and to learn difficult lessons about life as well as death.</p>"
  },
  {
    "movieID": 3543,
    "movieTitle": "Fury",
    "poster": "https://images-us-az.crackle.com/profiles/channels/3543/OneSheetImage_800x1200.jpg?ts=20180319090118",
    "mediaID": 2505109,
    "synopsis": "April, 1945. As the Allies make their final push in the European Theatre, a battle-hardened army sergeant named Wardaddy (Brad Pitt) commands a Sherman tank and her five-man crew on a deadly mission behind enemy lines. Outnumbered and outgunned, and with a rookie soldier thrust into their platoon, Wardaddy and his men face overwhelming odds in their heroic attempts to strike at the heart of Nazi Germany."
  },
  {
    "movieID": 3233,
    "movieTitle": "Ghost Rider: Spirit of Vengeance",
    "poster": "https://images-us-az.crackle.com/profiles/channels/3233/OneSheetImage_800x1200.jpg?ts=20170316090103",
    "mediaID": 2502194,
    "synopsis": "Still struggling with his curse as the devil’s bounty hunter, Johnny (Nicolas Cage) is hiding out in a remote part of Europe when he is recruited by a secret sect of the church to save a young boy from the devil. At first, Johnny is reluctant to embrace the power of the Ghost Rider, but it is the only way to protect the boy and possibly rid himself of his curse forever."
  },
  {
    "movieID": 897,
    "movieTitle": "Glory",
    "poster": "https://images-us-az.crackle.com/profiles/channels/897/OneSheetImage_800x1200.jpg?ts=20180119093954",
    "mediaID": 2482479,
    "synopsis": "<p>Winner of three Academy Awards&reg;, Glory tells the story of the Union Army&#39;s first black fighting unit in the American Civil War. The 54th Regiment of Massachusetts Volunteer Infantry was made up of black soldiers-some Northern freemen, some escaped slaves-and led by whites, including Robert Gould Shaw (Matthew Broderick), the son of Boston abolitionists. The unit faced virulent racism, not only from their Southern adversaries but from Northern whites who resisted arming black soldiers and doubted their ability to fight effectively. But in the bloody attack on Fort Wagner in Charleston, South Carolina, the members of the 54th distinguished themselves in an almost suicidal battle. Their heroic actions helped throw open the gates of the Union Army to 180,000 blacks who risked their lives for emancipation and citizenship, and may have helped turn the tide of the war.</p>"
  },
  {
    "movieID": 221,
    "movieTitle": "GO",
    "poster": "https://images-us-az.crackle.com/profiles/channels/221/OneSheetImage_800x1200.jpg?ts=20170112112151",
    "mediaID": 2410844,
    "synopsis": "<p>In Los Angeles, 18-year-old Ronna (Sarah Polley) and her reluctant partner-in-crime and fellow supermarket checkout clerk Claire (Katie Holmes) have come up with a desperate scheme to score some rent money and avoid eviction. Simon (Desmond Askew), an impulsive Brit, is driving a stolen car with buddy Marcus (Taye Diggs) during a no-holds-barred night of partying on the Las Vegas strip. TV soap opera stars Adam (Scott Wolf) and Zack (Jay Mohr) find themselves in the middle of a real-life drug sting. Set over a 24-hour period in L.A. and Las Vegas, this unconventionally structured comedy is told from the decidedly off-center perspectives of three parties involved in the outrageous events that surround a botched drug deal, all of whom discover they are in way over their heads.</p>"
  },
  {
    "movieID": 3163,
    "movieTitle": "The Green Hornet",
    "poster": "https://images-us-az.crackle.com/profiles/channels/3163/OneSheetImage_800x1200.jpg?ts=20170401063137",
    "mediaID": 2501075,
    "synopsis": "<p>Britt Reid (Seth Rogen), son and heir to Los Angeles&#39; largest newspaper fortune, is a rich, spoiled playboy who has been happy to maintain a direction-less existence. When his father James Reid (Tom Wilkinson) dies, Britt meets an impressive and resourceful company employee, Kato (Jay Chou). They realize that they have the resources to do something worthwhile with their lives and finally step out of James Reid&#39;s shadow. Kato builds the ultimate weapon, The Black Beauty, an indestructible car with every weapon imaginable and Britt decides that in order to be heroes, they will pose as villains. With the help of Britt&rsquo;s new secretary, Lenore Case (Cameron Diaz), they learn that the chief criminal in the city is named Benjamin Chudnofsky (Christoph Waltz). He has united all the gangs under his power, and he quickly sees that the Green Hornet is a direct threat to the prosperous criminal underworld he controls.</p>"
  },
  {
    "movieID": 2568,
    "movieTitle": "Guess Who",
    "poster": "https://images-us-az.crackle.com/profiles/channels/2568/OneSheetImage_800x1200.jpg?ts=20170111171034",
    "mediaID": 2493932,
    "synopsis": "When Theresa (Zoë Saldaña) brings fiancé Simon Green (Ashton Kutcher) home for her parents  25th wedding anniversary, she's neglected to mention one tiny detail - he's white. Determined to break hisdaughter's engagement, Percy Jones (Bernie Mac) does everything he can to make Simon feel apart of the family, from running his credit report to locking him in the basement at night. But when Percy gleefully exposes Simon's most embarrassing secret, it leads to an outrageous series of comic complications that only goes to prove that with a dad like Percy Jones, father doesn't always know best."
  },
  {
    "movieID": 3250,
    "movieTitle": "Heist",
    "poster": "https://images-us-az.crackle.com/profiles/channels/3250/OneSheetImage_800x1200.jpg?ts=20170423123206",
    "mediaID": 2502250,
    "synopsis": "A jewel thief's nephew is sent along on a heist to ensure a longtime partner in crime stays honest about the division of the loot."
  },
  {
    "movieID": 3585,
    "movieTitle": "The Hollow One",
    "poster": "https://images-us-az.crackle.com/profiles/channels/3585/OneSheetImage_800x1200.jpg?ts=20180611163945",
    "mediaID": 2505705,
    "synopsis": "In an isolated coastal community, Rachel Wade is sent down an emotionally destructive path after the tragic death of her mother. Forced to leave home, Rachel and her younger sister return years later to find their father missing and the community deserted. What starts as a search for answers quickly turns into a race for survival. In order to escape, Rachel must face her family’s dark history and a mysterious figure with sinister intentions."
  },
  {
    "movieID": 500,
    "movieTitle": "Hudson Hawk",
    "poster": "https://images-us-az.crackle.com/profiles/channels/500/OneSheetImage_800x1200.jpg?ts=20170721174941",
    "mediaID": 2479386,
    "synopsis": "Hudson Hawk (Bruce Willis), the world's greatest cat burglar, has just gotten out of prison after ten years, and has no plans on going back. His retirement is interrupted, however, when a bizarre wealthy couple, the Mayflowers (Richard E. Grant and Sandra Bernhard), threaten to kill his best friend Tommy (Danny Aiello) unless he agrees to steal three objects created by Leonardo Da Vinci. Hawk doesn't know these objects' significance beyond their historical value, nor does he know what to make of the beautiful and mysterious Anna Baragli (Andie MacDowell), an undercover nun who may be working for the CIA, the Vatican, or the Mayflowers. Ultimately it is up to Hudson Hawk to put an end to the Mayflowers' nefarious scheme, keep Tommy out of danger, enjoy a little time with Anna, and maybe even save the world."
  },
  {
    "movieID": 3170,
    "movieTitle": "The Hunt For The BTK Killer",
    "poster": "https://images-us-az.crackle.com/profiles/channels/3170/OneSheetImage_800x1200.jpg?ts=20170111171442",
    "mediaID": 2501066,
    "synopsis": "For 31 years, the serial killer known as BTK raised terror in the small town of Wichita, Kansas. Starting in 1974 and ending in 1991, BTK killed 10 people and resurfaced in 2005, in which the BTK killer was captured. This is the story of how police found, captured, and convicted the vicious killer named Dennis Rader."
  },
  {
    "movieID": 1155,
    "movieTitle": "I Spy",
    "poster": "https://images-us-az.crackle.com/profiles/channels/1155/OneSheetImage_800x1200.jpg?ts=20120621134214",
    "mediaID": 2484762,
    "synopsis": "<p>In this comedic adventure based on the 1960s TV series, special agent Alex Scott (Owen Wilson) and middleweight champion Kelly Robinson (Eddie Murphy) are reluctantly paired for a dangerous mission to recover the Switchblade, a sophisticated prototype spy plane. It has fallen into the hands of nefarious arms dealer Arnold Gundars (Malcolm McDowell), who plans to sell it to a rogue terrorist with access to nuclear warheads. Robinson is asked to penetrate Gundars&#39; palatial headquarters in Budapest while there to fight in a special bout arranged by the arms dealer, an avid boxing fan. But Scott and Robinson&#39;s newly forged friendship is put to the test when sudden disaster forces allies to become enemies, and the two men must race against time to prevent the Switchblade from embarking on its deadly mission.</p>"
  },
  {
    "movieID": 3341,
    "movieTitle": "In Bruges",
    "poster": "https://images-us-az.crackle.com/profiles/channels/3341/OneSheetImage_800x1200.jpg?ts=20170725112629",
    "mediaID": 2502734,
    "synopsis": "Guilt-stricken after a job gone wrong, hitman Ray and his partner await orders from their ruthless boss in Bruges, Belgium, the last place in the world Ray wants to be."
  },
  {
    "movieID": 3507,
    "movieTitle": "In The Cloud",
    "poster": "https://images-us-az.crackle.com/profiles/channels/3507/OneSheetImage_800x1200.jpg?ts=20180419103243",
    "mediaID": 2504991,
    "synopsis": "<p>Two estranged geniuses at a London tech incubator, Hale (Justin Chatwin, Shameless, War of the Worlds) and Theo Jones (Tomiwa Edun, The Hour, Merlin, Bates Motel), must reunite after the mysterious death of their mentor (Gabriel Byrne, An L.A. Minute, The Usual Suspects) to track down a serial terrorist bomber. In order to locate the bombs the pair creates a cutting-edge VR technology to upload and interact with the terrorist&rsquo;s memories. But the resulting &ldquo;memory cloud&rdquo; creates an artificial intelligence so powerful that they can&rsquo;t possibly anticipate its hazardous side effects&mdash;and hiding in the shadows are forces seeking to exploit the invention for their own insidious agendas. Also stars Nora Arnezeder (Safe House, The Words, Mozart in the Jungle) and Laura Fraser (Breaking Bad).</p>"
  },
  {
    "movieID": 2662,
    "movieTitle": "Iron Man: Rise Of Technovore",
    "poster": "https://images-us-az.crackle.com/profiles/channels/2662/OneSheetImage_800x1200.jpg?ts=20170130164929",
    "mediaID": 2495077,
    "synopsis": "Billionaire Tony Stark, in his Iron Man armor, prevents an attack from a mysterious new foe, but innocent bystanders are killed, including his best friend War Machine, Lt. Colonel James Rhodes.  Detained for questioning by S.H.I.E.L.D., Iron Man escapes, determined to find the mastermind behind the attack. Pursued by Black Widow and Hawkeye, Iron Man enlists the help of the ruthless vigilante The Punisher.  But can the Armored Avenger handle what he finds when he catches the person responsible and is forced to face his deadliest weapon, a biotechnology called Technovore that could wipe out all life on the planet?"
  },
  {
    "movieID": 3114,
    "movieTitle": "Jin-Roh",
    "poster": "https://images-us-az.crackle.com/profiles/channels/3114/OneSheetImage_800x1200.jpg?ts=20170111171846",
    "mediaID": 2500480,
    "synopsis": "<p>In a very different Tokyo from the one we know today, the totalitarian government rules with an iron fist. But a group called &quot;the Sect&quot; is staging demonstrations and challenging he government&#39;s martial law. Constable Fuse of the Capital Police&#39;s Special Unit is on a mission to stop a Sect demonstration when he encounters a girl in the sewers under Tokyo. When he fails to shoot as ordered, he is put on trail, questioned, and &quot;re-conditioned&quot; as a soldier. But the dead girl haunts him, both in his dreams and in the face of her sister, whom Fuse has befriended. But Fuse has made himself a target for some very powerful men. And as the world comes crashing down around him, Fuse is continually challenged to decide what is real and what is right.</p>"
  },
  {
    "movieID": 2674,
    "movieTitle": "Joe Dirt 2: Beautiful Loser",
    "poster": "https://images-us-az.crackle.com/profiles/channels/2674/OneSheetImage_800x1200.jpg?ts=20180524115835",
    "mediaID": 2495628,
    "synopsis": "<p>In the sequel to Joe Dirt, David Spade (Rules of Engagement, Saturday Night Live, Tommy Boy) returns as our favorite mulleted hero. After he&rsquo;s transported back in time, Dirt must fight to get back to the present and to his family. Stars Brittany Daniel (Joe Dirt), Patrick Warburton (Rules of Engagement, Ted, Sequestered), Christopher Walken (Wedding Crashers, True Romance), Mark McGrath (Sugar Ray) and Dennis Miller (Saturday Night Live, Dennis Miller Live).</p>"
  },
  {
    "movieID": 264,
    "movieTitle": "Johnny Mnemonic",
    "poster": "https://images-us-az.crackle.com/profiles/channels/264/OneSheetImage_800x1200.jpg?ts=20170112103314",
    "mediaID": 2438411,
    "synopsis": "In the 21st century, the most valuable information must be transported by mnemonic couriers like Johnny (Keanu Reeves), who contracts to deliver priceless data for a pair of scientists, defectors from the huge Pharmakom. The massive upload is too much for the mnemonic implant embedded in Johnny's brain, and he must find the secret access codes that allow him to download the information-or die. But data overload isn't the only thing threatening his life. The Yakuza, the world's most powerful crime syndicate, are working for Pharmakom, and Takahashi (Takeshi), the Yakuza sector chief, hires a ruthless bounty hunter (Dolph Lundgren) to bring in Johnny's head, cryogenically preserved. With an army of professional killers on his trail, and terminal brain-crash closer by the minute, Johnny's running for his life."
  },
  {
    "movieID": 3220,
    "movieTitle": "Lake Placid",
    "poster": "https://images-us-az.crackle.com/profiles/channels/3220/OneSheetImage_800x1200.jpg?ts=20170221103815",
    "mediaID": 2501793,
    "synopsis": "<p>Welcome to Black Lake. Its placid waters compliment the pristine Maine wilderness it borders. This tranquil setting is probably the last place you&#39;d expect a gruesome fatality. But then it&#39;s also the last place you&#39;d expect to find a 30-foot, narrow-snouted, multi-toothed, reptile of the species Crocodylus--an eating machine more commonly known as a crocodile. It is at this lake where an emotionally fragile, nature-phobic, New York paleontologist who&#39;s been reluctantly dispatched for her first real field assignment, teams up with an eccentric billionaire to find this menace.</p>"
  },
  {
    "movieID": 3026,
    "movieTitle": "Lake Placid 2",
    "poster": "https://images-us-az.crackle.com/profiles/channels/3026/OneSheetImage_800x1200.jpg?ts=20170111172314",
    "mediaID": 2498778,
    "synopsis": "<p>Three giant crocodiles terrorize locals and tourists at a lakeside resort.</p>"
  },
  {
    "movieID": 996,
    "movieTitle": "Last Action Hero",
    "poster": "https://images-us-az.crackle.com/profiles/channels/996/OneSheetImage_800x1200.jpg?ts=20170130165238",
    "mediaID": 2482817,
    "synopsis": "Action-adventure superstar Arnold Schwarzenegger bursts through the screen as a larger-than-life movie hero in this nonstop adventure from acclaimed director John McTiernan (Predator, Die Hard)."
  },
  {
    "movieID": 827,
    "movieTitle": "Lords Of Dogtown",
    "poster": "https://images-us-az.crackle.com/profiles/channels/827/OneSheetImage_800x1200.jpg?ts=20180514114350",
    "mediaID": 2481453,
    "synopsis": "LORDS OF DOGTOWN tells the radical true story behind three teenage surfers from Venice Beach, California, who took skateboarding to the extreme and changed the world of sports forever.  Stacy Peralta(John Robinson), Tony Alva (Victor Rasuk) and Jay Adams (Emile Hirsch) are the Z-Boys, a bunch of nobodies until they create a new style of skateboarding that becomes a worldwide phenomenon. But when their hobby becomes a business, the success shreds their friendship. Directed by Catherine Hardwicke (Twilight) and written by Stacy Peralta, Lords of Dogtown is \"...a dazzling daredevil ride.\" (Peter Travers, ROLLING STONE)"
  },
  {
    "movieID": 3495,
    "movieTitle": "Lupin The 3rd: Legend Of Gold Babylon",
    "poster": "https://images-us-az.crackle.com/profiles/channels/3495/OneSheetImage_800x1200.jpg?ts=20180129154641",
    "mediaID": 2504860,
    "synopsis": "Master thief and lover of treasures, Lupin the Third is after the long-lost Gold of Babylon! With the aid of his partners Jigen and Goemon, Lupin treks the globe unraveling clues, dodging the violent New York Mafia, and escaping the tenacious Interpol Inspector Zenigata and his team of five beautiful and determined policewomen. And what connection does the drunken, flirtatious old woman Rosetta have with the fabled Babylonian gold? Co-directed by the cult favorite film director Seijun Suzuki and matched with Yuji Ohno's infectious breed of jazz, this animated romp is a bizarre and colorful adventure that takes viewers from New York to the Middle East (and back!) in search of a fabulous treasure inspired by the biblical Tower of Babel."
  },
  {
    "movieID": 3199,
    "movieTitle": "Mad Families",
    "poster": "https://images-us-az.crackle.com/profiles/channels/3199/OneSheetImage_800x1200.jpg?ts=20180524121319",
    "mediaID": 2501637,
    "synopsis": "From the minds of Fred Wolf and David Spade (Joe Dirt and Joe Dirt 2: Beautiful Loser) comes a comic romp about family, pride and porta-potty races. On July 4th weekend, Saltstone Park brims with families eager to relax. At campsite 16, however, the Jones, Jones and Jonas families find that their campsite has been overbooked. What starts as a simple clerical error quickly spirals into a family feud fueled by the rivalry of three equally stubborn leaders: Jose (Juan Gabriel Pareja, Goliath, The Walking Dead), an affable but slovenly slacker; Franklin (Finesse Mitchell, Roadies, Brothers in Atlanta), a rising politician with a disdain for the outdoors; and Charlie (Charlie Sheen, Two and a Half Men, Anger Management), a goofy, alcoholic hairdresser. By way of porta-potty races and sexually-charged forest encounters, these determined families wage a ferocious war for the right to holiday fun. When Jose’s sister, Felipa (Naya Rivera, Glee, Devious Maids), and Franklin both admit that the trip was all a ploy, the plot thickens. Also starring Leah Remini (The King of Queens, The Talk), Charlotte McKinney (Joe Dirt 2: Beautiful Loser), Chris Mulkey (Whiplash, CSI: Cyber) Clint Howard (Arrested Development, Key & Peele), Chanel Iman (Dope), Barry Shabaka Henley (Brothers in Atlanta, Better Call Saul), LilRel Howery (The Carmichael Show), Tiffany Haddish (The Carmichael Show), Efren Ramirez (Eastbound and Down, Napoleon Dynamite), Naomi Kyle (IGN Daily Fix, Batkid Begins) and Danny Mora (Chop Shop, McFarland, USA)."
  },
  {
    "movieID": 3527,
    "movieTitle": "The Matrix",
    "poster": "https://images-us-az.crackle.com/profiles/channels/3527/OneSheetImage_800x1200.jpg?ts=20180119082914",
    "mediaID": 2504638,
    "synopsis": "When a beautiful stranger (Carrie Ann Moss) leads computer hacker Neo (Keanu Reeves) to a forbidding underworld, he discovers the shocking truth--the life he knows is the elaborate deception of an evil cyber-intelligence. Neo joins legendary and dangerous rebel warrior Morpheus (Lawrence Fishburne) in the battle to destroy the illusion enslaving humanity. Now, every move, every second, every thought becomes a fight to stay alive--to escape The Matrix."
  },
  {
    "movieID": 3513,
    "movieTitle": "The Matrix Reloaded",
    "poster": "https://images-us-az.crackle.com/profiles/channels/3513/OneSheetImage_800x1200.jpg?ts=20180611164131",
    "mediaID": 2504798,
    "synopsis": "In the second chapter of the Matrix trilogy, Zion falls under siege to the Machine Army. Only hours before 250,000 Sentinels destroy the last human enclave on Earth--and its growing resistance--Neo (Keanu Reeves) and Trinity (Carrie-Anne Moss) choose to return to the Matrix with Morpheus (Laurence Fishburne), unleashing their arsenal of extraordinary skills and weaponry against the forces of repression and exploitation."
  },
  {
    "movieID": 3514,
    "movieTitle": "The Matrix Revolutions",
    "poster": "https://images-us-az.crackle.com/profiles/channels/3514/OneSheetImage_800x1200.jpg?ts=20180611164150",
    "mediaID": 2504797,
    "synopsis": "In this explosive final chapter of the Matrix trilogy, Neo, Morpheus and Trinity battle to defend Zion, the last real-world city, against the onslaught of the machines that have enslaved the human race. And, now as Neo learns more about his heroic powers--including the ability to see the codes of things and the people, he faces the consequences of the choice made in The Matrix Reloaded."
  },
  {
    "movieID": 568,
    "movieTitle": "The Net",
    "poster": "https://images-us-az.crackle.com/profiles/channels/568/OneSheetImage_800x1200.jpg?ts=20170721174522",
    "mediaID": 2488450,
    "synopsis": "A freelance computer systems analyst is plunged into a web of corruption and murder when she stumbles onto a program she was never meant to see."
  },
  {
    "movieID": 2426,
    "movieTitle": "Obsessed",
    "poster": "https://images-us-az.crackle.com/profiles/channels/2426/OneSheetImage_800x1200.jpg?ts=20180119122826",
    "mediaID": 2493040,
    "synopsis": "In this edge-of-your-seat thriller a successful professional man (Idris Elba) with a beautiful wife (Beyoncé Knowles) finds his idyllic life threatened by a temp in his office (Ali Larter) who turns out to be a stalker."
  },
  {
    "movieID": 1015,
    "movieTitle": "Panic Room",
    "poster": "https://images-us-az.crackle.com/profiles/channels/1015/OneSheetImage_800x1200.jpg?ts=20120621134435",
    "mediaID": 2487163,
    "synopsis": "When her home is invaded by three armed robbers, a divorced woman and her young daughter hide in their specially designed \"panic room\" but end up in a deadly cat-and-mouse game anyway."
  },
  {
    "movieID": 1424,
    "movieTitle": "Paprika",
    "poster": "https://images-us-az.crackle.com/profiles/channels/1424/OneSheetImage_800x1200.jpg?ts=20180326161148",
    "mediaID": 2486881,
    "synopsis": "A group of brilliant scientists have developed a form of psychotherapy with the invention of a machine which enables a person to enter anothers' dreams.  When the device is stolen by a \"dream terrorist,\" it is up Atsuko Chiba, a scientist under the code name PAPRIKA, to track down the apparatus and save the world from madness."
  },
  {
    "movieID": 3360,
    "movieTitle": "Party Boat",
    "poster": "https://images-us-az.crackle.com/profiles/channels/3360/OneSheetImage_800x1200.jpg?ts=20180419103142",
    "mediaID": 2503162,
    "synopsis": "<p>Max is throwing a birthday party for his best friend and secret crush, Kiley. When Max finds out Kiley&#39;s boyfriend plans to propose, he vows to win her heart by throwing her the best rager ever. Stars Brett Davern (Awkward, Chosen), Katie Leclerc (Switched at Birth, Confess), Jay Mohr (SNL, Jerry Maguire) and Sung Kang (Power, Fast &amp; Furious 6),&nbsp;Beau Mirchoff (Awkward, Scary Movie 4), and Demetrius Bridges (Vampire Diaries).</p>"
  },
  {
    "movieID": 3334,
    "movieTitle": "Point Break",
    "poster": "https://images-us-az.crackle.com/profiles/channels/3334/OneSheetImage_800x1200.jpg?ts=20180119083107",
    "mediaID": 2502732,
    "synopsis": "<p>Keanu Reeves and Patrick Swayze star in this nonstop action thriller about an FBI agent lured by the rush when he goes undercover to unmask a band of thrill-seeking surfers who rob banks to fund their addiction to pulling off the most daring score, surviving the greatest danger . . . and riding the biggest wave--Point Break.</p>"
  },
  {
    "movieID": 1068,
    "movieTitle": "Reign Over Me",
    "poster": "https://images-us-az.crackle.com/profiles/channels/1068/OneSheetImage_800x1200.jpg?ts=20170721173849",
    "mediaID": 2483623,
    "synopsis": "A man who lost his family in the September 11 attack on New York City runs into his old college roommate. Rekindling the friendship is the one thing that appears able to help the man recover from his grief."
  },
  {
    "movieID": 3602,
    "movieTitle": "The Remaining",
    "poster": "https://images-us-az.crackle.com/profiles/channels/3602/OneSheetImage_800x1200.jpg?ts=20180611164428",
    "mediaID": 2505700,
    "synopsis": "The Remaining is an action-packed supernatural thriller that addresses questions of life, love and belief against an apocalyptic backdrop. A group of close friends gather for a wedding, but the celebration is shattered by a series of cataclysmic events and enemies foretold by biblical end-times prophecies. The survivors face a horrifying, uncertain future as they scramble for safety. But as their world collapses around them in chaos and terror will they choose real life through faith, or just try to survive?"
  },
  {
    "movieID": 2331,
    "movieTitle": "The River Murders",
    "poster": "https://images-us-az.crackle.com/profiles/channels/2331/OneSheetImage_800x1200.jpg?ts=20170111174106",
    "mediaID": 2491417,
    "synopsis": "The sins of the past are not forgotten in this chilling suspense thriller starring Ray Liotta, Christian Slater and Ving Rhames.  When the first body was discovered, it seemed a coincidence. But now homicide detective Jack Verdon (Liotta) has cause to worry: the victims of a series of brutal sex murders are all his former girlfriends. Suspected by the FBI agent who’s taken over the case (Slater) and suspended by his captain (Rhames), Jack must work outside the law if he’s to find the killer, save his future and protect what’s left of his past."
  },
  {
    "movieID": 943,
    "movieTitle": "Robotech: The Shadow Chronicles",
    "poster": "https://images-us-az.crackle.com/profiles/channels/943/OneSheetImage_800x1200.jpg?ts=20170111174135",
    "mediaID": 2482511,
    "synopsis": "<p>In the year 2044 AD, the human race has reached out to the stars through the miracle of ROBOTECHNOLOGY, but not without bringing intergalactic war upon the Earth itself.  Featuring the voices of Mark Hamill (Star Wars) and Chase Masterson (Star Trek: Deep Space 9), ROBOTECH: THE SHADOW CHRONICLES features cutting edge CG animation beautifully composited with vibrant anime characters.</p>"
  },
  {
    "movieID": 3583,
    "movieTitle": "Roger Corman’s Operation Rogue",
    "poster": "https://images-us-az.crackle.com/profiles/channels/3583/OneSheetImage_800x1200.jpg?ts=20180611164558",
    "mediaID": 2505701,
    "synopsis": "<p>Deep in the jungles of Southeast Asia, a terrorist organization has stolen materials to create a dangerous chemical bomb. It is up to Captain Max Randall (Mark Dacascos, TV&rsquo;s &ldquo;Hawaii Five-0&rdquo;) and his team of Marines to stop them. But when Randall&rsquo;s team kills the terrorist leader&rsquo;s son, the group responds by kidnapping General Wallace&rsquo;s (Treat Williams, TV&rsquo;s &ldquo;Chicago Fire&rdquo;) daughter. It is up to Randall to save her and stop the terrorist attack in this action-packed, explosive thriller from legendary producer Roger Corman.</p>"
  },
  {
    "movieID": 2765,
    "movieTitle": "Secret Window",
    "poster": "https://images-us-az.crackle.com/profiles/channels/2765/OneSheetImage_800x1200.jpg?ts=20160630155725",
    "mediaID": 2493695,
    "synopsis": "<p><span style=\"font-size: 11.0pt; font-family: 'Calibri','sans-serif'; mso-fareast-font-family: Calibri; mso-fareast-theme-font: minor-latin; mso-bidi-font-family: 'Times New Roman'; color: #1f497d; mso-ansi-language: EN-US; mso-fareast-language: EN-US; mso-bidi-language: AR-SA;\">Academy Award&reg; nominee Johnny Depp (2003 Best Actor, Pirates of the Caribbean: The Curse of the Black Pearl) gives his most riveting performance in this action/suspense thriller featuring a top-notchcast including John Turturro, Maria Bello, Academy Award&reg; winner Timothy Hutton (1981 Best Supporting Actor, Ordinary People) and Charles S. Dutton.&nbsp; Following a bitter separation from his wife (Bello), famed mystery writer Mort Rainey (Depp) is unexpectedly confronted at his remote lake house by adangerous stranger named John Shooter (Turturro).&nbsp; Claiming Rainey has plagiarized his short story, the psychotic Shooter demands justice.&nbsp; When Shooter's demands turn to threats - and then murder - Rainey turns to a private detective (Dutton) for help.&nbsp; But when nothing stops the horror from spiraling out of control, Rainey soon discovers he can't trust anyone or anything.</span></p>"
  },
  {
    "movieID": 242,
    "movieTitle": "Single White Female",
    "poster": "https://images-us-az.crackle.com/profiles/channels/242/OneSheetImage_800x1200.jpg?ts=20170112105240",
    "mediaID": 2419510,
    "synopsis": "<p>When self-employed New York career woman Bridget Fonda advertises for a roommate her problem is apparently solved when Jennifer Jason Leigh answers her ad. The delicate balance of their relationship goes terrifyingly awry spiraling toward a violent climax in which only one of them will survive.</p>"
  },
  {
    "movieID": 508,
    "movieTitle": "So I Married An Axe Murderer",
    "poster": "https://images-us-az.crackle.com/profiles/channels/508/OneSheetImage_800x1200.jpg?ts=20170111093130",
    "mediaID": 2479387,
    "synopsis": "Mike Myers takes the lead in this rousing comedy thriller as a romantically-jaded performance artist who finally thinks he's met his match in beautiful butcher  Nancy Travis. Their romance begins to flounder when he suspects that she's up to murder."
  },
  {
    "movieID": 1302,
    "movieTitle": "Spun",
    "poster": "https://images-us-az.crackle.com/profiles/channels/1302/OneSheetImage_800x1200.jpg?ts=20150903180443",
    "mediaID": 2485927,
    "synopsis": "Three days of epic drug binging become a meth-induced odyssey for college dropout Ross when he becomes the local crystal meth cook's personal driver in exchange for free drugs. Bouncing from one bizarre situation to another, Ross slowly slips deeper and deeper into the crazy anonymous world of speed freaks in which there exists no boundaries or morality.  With an all star cast including Brittany Murphy, Jason Schwartzman, John Leguizamo, Patrick Fugit, Mena Suvari, and an unfortunate green dog, get ready to see the city through eyes that can't sleep.  It's SPUN."
  },
  {
    "movieID": 479,
    "movieTitle": "Stan Lee’s Mutants, Monsters And Marvels",
    "poster": "https://images-us-az.crackle.com/profiles/channels/479/OneSheetImage_800x1200.jpg?ts=20161208071647",
    "mediaID": 2478288,
    "synopsis": "<p>Filmmaker/Comic Writer Kevin Smith interviews comic book legend Stan Lee about his life and work in comics.</p>"
  },
  {
    "movieID": 3496,
    "movieTitle": "Street Fighter II: Animated Movie",
    "poster": "https://images-us-az.crackle.com/profiles/channels/3496/OneSheetImage_800x1200.jpg?ts=20180119122620",
    "mediaID": 2504564,
    "synopsis": "Get your quarters ready, because the world's top fighters are about to go head to head in this explosive animated adaptation of the classic Street Fighter II arcade game! M. Bison's plan to crush those who would oppose his organization, Shadowloo, is simple: brainwash the strongest martial artists around with his dreaded psycho power, and turn them into living weapons! To stop him, Interpol agent Chun-Li must team up with Major Guile of the United States Air Force, but that's no small feat. They'll have to put aside their differences and learn to work together, and fast. Bison is closing in on Ryu, a traveling vagabond said to be the best fighter in the world. Fortunately (or not), Ryu is a hard man to find, but the same can't be said of his eternal rival, Ken. And it might just be through Ken that Bison will get what he wants! Can the World Warriors beat Bison to the punch?"
  },
  {
    "movieID": 3584,
    "movieTitle": "Superstar",
    "poster": "https://images-us-az.crackle.com/profiles/channels/3584/OneSheetImage_800x1200.jpg?ts=20180611164049",
    "mediaID": 2505702,
    "synopsis": "<p>Mary Catherine Gallagher, an ultra-geeky Catholic school girl not known for her strong hygiene, sets out to become a superstar so that she may experience the thrill of a Hollywood screen kiss - for real. Based on the character Mary Katherine Gallagher from NBC&#39;s Saturday Night Live sketch.</p>"
  },
  {
    "movieID": 3355,
    "movieTitle": "Takers",
    "poster": "https://images-us-az.crackle.com/profiles/channels/3355/OneSheetImage_800x1200.jpg?ts=20170725111649",
    "mediaID": 2502754,
    "synopsis": "TAKERS takes you into the world of a notorious group of criminals (Idris Elba, Paul Walker, T.I., Chris Brown, Hayden Christensen and Michael Ealy) who continue to baffle police by pulling off perfectly executed bank robberies. They are in and out like clockwork, leaving no evidence behind and laying low between heists. But when they attempt to pull off one last job with more money at stake than ever before, the crew may find their plans interrupted by a hardened detective (Matt Dillon) who is hell-bent on solving the case."
  },
  {
    "movieID": 3603,
    "movieTitle": "That’s My Boy",
    "poster": "https://images-us-az.crackle.com/profiles/channels/3603/OneSheetImage_800x1200.jpg?ts=20180611164523",
    "mediaID": 2505704,
    "synopsis": "<p>As a teenager, an illicit fling with his sexy school teacher catapults Donny Levine into a brief period of borderline notoriety. However, as his fame fizzles out, Donny becomes just another unskilled, unloved, middle-aged loser with debts to pay off. So, when he learns that the progeny of his underage affair is now all grown up and about to marry into a successful family, Donny attempts to reconnect with the son he barely knows, who wants nothing to do with him, and his soon-to-be in-laws.</p>"
  },
  {
    "movieID": 2582,
    "movieTitle": "The Throwaways",
    "poster": "https://images-us-az.crackle.com/profiles/channels/2582/OneSheetImage_800x1200.jpg?ts=20180524121139",
    "mediaID": 2494494,
    "synopsis": "<p>Jeremy Renner (The Hurt Locker, American Hustle, The Bourne Legacy) executive produces this&nbsp;Sony&nbsp;Crackle Original movie, a tense cyber thriller starring Kevin Dillon (Entourage), James Caan (The Godfather), Sam Huntington (Superman Returns, Fanboys) and Katie McGrath (Jurassic World).</p>"
  },
  {
    "movieID": 1470,
    "movieTitle": "Today You Die",
    "poster": "https://images-us-az.crackle.com/profiles/channels/1470/OneSheetImage_800x1200.jpg?ts=20170721172709",
    "mediaID": 2487104,
    "synopsis": "Steven Seagal stars as Harlan Banks, an ex-con who is hired to drive a delivery truck in Las Vegas. When he picks up $20 million in cash, his double-crossing partner blasts two security men and holds his gun to Banks' head, ordering him to drive. After one of the most extraordinary chase scenes ever filmed on the streets of Las Vegas, Banks gets away with the money, but eventually lands in prison. Now his former \"partners\" want the money and will do anything to get it. But with the assistance of newfound friend Ice Cool (Anthony \"Treach\" Criss), he escapes to claim what's his and unleash an explosive vengeance. Proving that the fist is mightier than the gun, Banks doesn't give up until he makes off with both a sympathetic FBI agent and the money."
  },
  {
    "movieID": 1163,
    "movieTitle": "Truth Or Consequences, N.M. (1997)",
    "poster": "https://images-us-az.crackle.com/profiles/channels/1163/OneSheetImage_800x1200.jpg?ts=20170112115302",
    "mediaID": 2484765,
    "synopsis": "<p>Truth or Consequences, N.M. is the gritty, romantic story of petty criminal Raymond Lembecke (Vincent Gallo) and the woman he loves, Addy Monroe (Kim Dickens). Fresh out of jail, Raymond is determined to find enough money to take Addy away with him forever. But getting ahold of the cash has dire consequences for the couple, as they hook up with Ray&#39;s former prisonmate and wild man Curtis Freley (Kiefer Sutherland) and his associate, the enigmatic Marcus (Mykelti Williamson). When their simple plan for an easy theft goes awry and an undercover cop is killed, Raymond, Addy, Curtis and Marcus go on the lam, taking two yuppie hostages (Kevin Pollak and Grace Phillips) with them. Desperate to make their dream come true, Ray and Addy follow Curtis down a road from which there may be no return.</p>"
  },
  {
    "movieID": 1825,
    "movieTitle": "Urban Legend",
    "poster": "https://images-us-az.crackle.com/profiles/channels/1825/OneSheetImage_800x1200.jpg?ts=20170130171650",
    "mediaID": 2489825,
    "synopsis": "<p>Dr. Wexler (Robert Englund), professor of American Folklore at New England&#39;s Pendleton College, states that urban legends exist only to convey hidden moral lessons for all who hear them. But the students at New England&#39;s Pendleton College are finding out just how fatal these stories can really be. When a series of murders occurs among Pendleton&#39;s faculty and student body, Natalie (Alicia Witt), a young, bright student, begins to notice a bizarre link between the killings. Recognizing that all of the deaths have a resemblance to one urban legend or another, Natalie investigates Pendleton&#39;s own 30-year-old legend about a series of murders at the hand of an abnormal psych professor. She then discovers a twisted plan to create the ultimate urban legend and her lifeless body is the centerpiece.</p>"
  },
  {
    "movieID": 3498,
    "movieTitle": "Urusei Yatsura 2: Beautiful Dreamer",
    "poster": "https://images-us-az.crackle.com/profiles/channels/3498/OneSheetImage_800x1200.jpg?ts=20180129154626",
    "mediaID": 2504904,
    "synopsis": "Tomobiki High is in a frenzy to get ready for the school festival. Props need to be made, costumes designed, and maybe somewhere sleep to be had! Ataru, Lum, Shutaro, Shinobu, and the rest of Class 2-4 are determined to not be outdone this year, and they're rushing to make the final preparations for tomorrow's grand opening. Once they wake up the next morning, they continue their mad rush to get ready for tomorrow's grand opening. And then the next day... hey, isn't something strange going on? Silence lingers over the city, the buildings filled with nothing but dust and mold. Is this a dream? Or have the kids (and a few related adults) of Class 2-4 finally woken up? If they can spend each day having fun with each other, does it matter?"
  },
  {
    "movieID": 3499,
    "movieTitle": "Wicked City",
    "poster": "https://images-us-az.crackle.com/profiles/channels/3499/OneSheetImage_800x1200.jpg?ts=20180119122144",
    "mediaID": 2504858,
    "synopsis": "It's not unusual for lady-killer Renzaburo Taki to share a night with a woman. When that woman can turn into a demonic spider, however, it's just a little worrying. The demons are on the move, and as a member of the Black Guard, Taki's job--his *real* job--is to protect the human world from the demon world. And his work is just beginning! A fragile peace exists between the two worlds, brokered by a treaty. In order for the renewal of that treaty to go smoothly, Taki has to protect Giuseppi Mayart, a two hundred year old man with immense spiritual power, from an extremist faction of demons seeking to bring chaos to the two worlds. Worst of all, Taki's assigned a partner for the mission: the unnaturally beautiful Makie, a fellow Black Guard member... and herself a demon! The two will have to go all out to protect the old man, as not only are the demons going to extreme lengths to kill him, but Mayart seems oddly unconcerned for his own safety. Is there more going on than Taki and Makie realize?"
  },
  {
    "movieID": 2667,
    "movieTitle": "Woke Up Dead",
    "poster": "https://images-us-az.crackle.com/profiles/channels/2667/OneSheetImage_800x1200.jpg?ts=20170111180055",
    "mediaID": 2491705,
    "synopsis": "<p>Drex (Jon Heder, Napoleon Dynamite) is just another college poindexter, until he fulfills every emo-goth&rsquo;s dream by waking up without a heartbeat. It&rsquo;s not easy being a nerd and a zombie, but the change allows him to land a job and catch the eye of a cute med student. Only a shadowy agency knows why he Woke Up Dead. Also stars Josh Gad (The Wedding Ringer, Frozen) Krysten Ritter (Breaking Bad, Jessica Jones) and Wayne Knight (Seinfeld).</p>"
  },
  {
    "movieID": 1782,
    "movieTitle": "Young Guns",
    "poster": "https://images-us-az.crackle.com/profiles/channels/1782/OneSheetImage_800x1200.jpg?ts=20180319092550",
    "mediaID": 2489475,
    "synopsis": "Western adventure, based on a true story, about six young men hired to guard an Englishman's ranch against a mob in 1870s New Mexico."
  },
  {
    "movieID": 1060,
    "movieTitle": "Young Guns II",
    "poster": "https://images-us-az.crackle.com/profiles/channels/1060/OneSheetImage_800x1200.jpg?ts=20180319092739",
    "mediaID": 2489772,
    "synopsis": "Billy the Kid, Jose Chavez and Doc Scurlock return in Young Guns II, which is the story of Billy the Kid and his race to safety in Old Mexico while being trailed by a group of government agents led by Pat Garrett. Along the way, Billy's crew gains three new recruits."
  },
  {
    "movieID": 3588,
    "movieTitle": "Zodiac",
    "poster": "https://images-us-az.crackle.com/profiles/channels/3588/OneSheetImage_800x1200.jpg?ts=20180611163734",
    "mediaID": 2505707,
    "synopsis": "In the late 1960s/early 1970s, a San Francisco cartoonist becomes an amateur detective obsessed with tracking down the Zodiac Killer, an unidentified individual who terrorizes Northern California with a killing spree."
  }
]