[{"movieLink":"https://www.hmnow.com/films/chesapeake_shores_s1e01","imgLink":"https://d2eqr2grgdk9bg.cloudfront.net/v3/image/960f9d31e22e68792a3a5505bd282612.jpg?width=502","synopsis":"Abby (Meghan Ory) takes her twin daughters from New York back to her hometown in Maryland at the request of her sister Jess (Laci J. Mailey), where she clashes with her father Mick (Treat Williams) and runs into her high school sweetheart, Trace (Jesse Metcalfe)."},{"movieLink":"https://www.hmnow.com/films/signed_sealed_delivered_movie","imgLink":"https://d2eqr2grgdk9bg.cloudfront.net/v3/image/88d1ec00aa8cf90f2137baf300778ae2.jpg?width=502","synopsis":"Shane McInerney (Kristin Booth) joins the Dead Letter Office of the U.S. Postal Service, where dedicated leader Oliver O'Toole (Eric Mabius) and his team work to reunite a young couple who spent one day together and then were kept apart by tragic circumstances."},{"movieLink":"https://www.hmnow.com/films/sue_thomas_s1e01","imgLink":"https://d2eqr2grgdk9bg.cloudfront.net/v3/image/b72a47c181e2744e025ecaee01ac5d52.jpg?width=502","synopsis":"Sue Thomas (Deanne Bray) is a somewhat sheltered young deaf woman who has recently graduated from college and is about to start her first real job which happens to be with the F.B.I."},{"movieLink":"https://www.hmnow.com/films/heartland_s01e01","imgLink":"https://d2eqr2grgdk9bg.cloudfront.net/v3/image/99bca0efc1ee3934489fbbd6fce79b44.jpg?width=502","synopsis":"Marion Fleming and her daughter, Amy, are on the way to rescue a horse named Spartan when the unthinkable happens."},{"movieLink":"https://www.hmnow.com/films/wildfire_s01e01","imgLink":"https://d2eqr2grgdk9bg.cloudfront.net/v3/image/8027d206a89ecee6d331763ae3d7f038.jpg?width=502","synopsis":"Kris Furillo is a young girl with a troubled past who gets a second chance luckily when she goes to work at a horse farm, but being an outsider in a high-stakes world is not easy."},{"movieLink":"https://www.hmnow.com/films/snowy_river_s1e01","imgLink":"https://d2eqr2grgdk9bg.cloudfront.net/v3/image/112d5d9b7668ea3fbb3ff78d7bcae03a.jpg?width=502","synopsis":"The famous Matt McGregor finds himself drawn to a beautiful young widow who has returned to Australia, while at the same time a mysterious and dangerous young American lad challenges him."},{"movieLink":"https://www.hmnow.com/films/legacy_s1e01","imgLink":"https://d2eqr2grgdk9bg.cloudfront.net/v3/image/d4443fccb9127d1194b50c69416cef26.jpg?width=502","synopsis":"During post-civil war, Ned Logan, a wealthy widower, is raising a family all on his own. Ned's streetwise adopted son clashes with his youngest son, Clay, as well as the southern society. Meanwhile, Sean reconsiders his impending engagement to debutante, Vivian Winters."},{"movieLink":"https://www.hmnow.com/films/little_men_s1e01","imgLink":"https://d2eqr2grgdk9bg.cloudfront.net/v3/image/485b3ced3508420ea11665be7468a05d.jpg?width=502","synopsis":"Josephine (Jo) Bhaer and her husband Fritz have run a boarding school for boys for several years. Now that Fritz has died everyone assumes that Jo will close the school. When Nick, a sailor home from the sea, hires on as handyman, Jo sees that there is a chance to keep the school open."},{"movieLink":"https://www.hmnow.com/films/emily_of_new_moon_s1e01","imgLink":"https://d2eqr2grgdk9bg.cloudfront.net/v3/image/a36860ced5b9046ec83b69cae9947a9b.jpg?width=502","synopsis":"Emily is raised by her father who encourages her to always follow her heart and dreams. When Emily's father passes away she must move in with her Aunt Laura and Cousin Jimmy at New Moon."},{"movieLink":"https://www.hmnow.com/films/highway_to_heaven_s1e01","imgLink":"https://d2eqr2grgdk9bg.cloudfront.net/v3/image/12d79bf1015b1f44d9b5db3edda5473c.jpg?width=502","synopsis":"Jonathan Smith, an angel, arrives at a retirement home to help not only the occupants but also the administrator Leslie Gordon. However, Leslie's brother Mark, a jaded and bitter former police officer, is suspicious of Jonathan."},{"movieLink":"https://www.hmnow.com/films/miracle-s1e01","imgLink":"https://d2eqr2grgdk9bg.cloudfront.net/v3/image/5b54d6299b6be36fcd98619002405135.jpg?width=502","synopsis":"Girls Survive Big Wave; Aussie Capsized; Deserted Baby Success; Dog Saves Boy"},{"movieLink":"https://www.hmnow.com/films/ties_that_bind_s1e01","imgLink":"https://d2eqr2grgdk9bg.cloudfront.net/v3/image/dda264a5d3faf5c61b20f68dc6143418.jpg?width=502","synopsis":"Police detective Allison McLean takes in her nephew and niece, Mariah and Cameron, after their father is sentenced to prison for two years. Allison and her husband, Matt, try to make the best of the new situation, which also includes their own teenagers Jeff and Rachel. Cameron's anger against Allison gets the best of him, as he blames her for his father going to prison. Meanwhile, Allison and her partner, Devin, work on a case involving a pregnant teen and her boyfriend who have just robbed a pharmacy."},{"movieLink":"https://www.hmnow.com/films/anastasia_1","imgLink":"https://d2eqr2grgdk9bg.cloudfront.net/v3/image/74b01d52d4862333790ff7ea280ba3be.jpg?width=502","synopsis":"Anna Anderson (Amy Irving) is found in a German asylum in the 1920s with an unbelievable story -- she is actually Anastasia, the daughter of Czar Nicholas II and the last surviving member of the royal Romanov family."},{"movieLink":"https://www.hmnow.com/films/erich_segals_only_love_part_on","imgLink":"https://d2eqr2grgdk9bg.cloudfront.net/v3/image/769abeacd15b14e0d730978bf4dfdb3e.jpg?width=502","synopsis":"Matthew (Rob Morrow), an American doctor in a war zone, must give up his true love Silvia, but after he returns home and settles down with single mother Evie (Marisa Tomei), Silvia comes back into his life needing his help."},{"movieLink":"https://www.hmnow.com/films/confederate_widow_1","imgLink":"https://d2eqr2grgdk9bg.cloudfront.net/v3/image/184fcaedacd3699ce6d43361185fc10c.jpg?width=502","synopsis":"At age 99, Lucy (Anne Bancroft) is the last woman alive to have been married to a Confederate soldier, and she recalls her struggles as a younger woman (Diane Lane) through a century of turmoil."},{"movieLink":"https://www.hmnow.com/films/mama_floras_family_part_1","imgLink":"https://d2eqr2grgdk9bg.cloudfront.net/v3/image/6f9ee1e0f229fb69e841f9043c59b9d8.jpg?width=502","synopsis":"Flora (Cicely Tyson) was born in poverty at the dawn of the 20th century and dedicated herself to creating a better life for her sons (Blair Underwood and Mario Van Peebles) and granddaughter (Queen Latifah)."},{"movieLink":"https://www.hmnow.com/films/jackie_ethel_joan_1","imgLink":"https://d2eqr2grgdk9bg.cloudfront.net/v3/image/8c458a6bcb1dc7a2d35c2051c7326af2.jpg?width=502","synopsis":"Jackie (Jill Hennessy), Ethel (Lauren Holly) and Joan (Leslie Stefanson), the wives of the Kennedy brothers, develop a bond over times of political upheaval and personal tragedies."},{"movieLink":"https://www.hmnow.com/films/the_titanic_part_1","imgLink":"https://d2eqr2grgdk9bg.cloudfront.net/v3/image/380611f5ade3b575f0c54cfb1881c652.jpg?width=502","synopsis":"A married woman (Catherine Zeta-Jones) has a chance reunion with her long-lost love (Peter Gallagher) and crosses paths with real-life figures like Molly Brown (Marliu Henner) onboard the doomed luxury liner in 1912."},{"movieLink":"https://www.hmnow.com/films/the_five_people_you_meet_in_he","imgLink":"https://d2eqr2grgdk9bg.cloudfront.net/v3/image/d71b4bdb0edcac2c9d0c2c52ca0b0368.jpg?width=502","synopsis":"Eddie (Jon Voight), a war vet and amusement park worker, dies while trying to save a girl from an accident, and in the afterlife, five people help him understand the meaning of his life."},{"movieLink":"https://www.hmnow.com/films/tess_durbervilles_part1","imgLink":"https://d2eqr2grgdk9bg.cloudfront.net/v3/image/052c797d426b246b9feb79354e7e7d46.jpg?width=502","synopsis":"Based on Thomas Hardy's classic novel, Tess, a poor country girl, learns she is distantly related to the well-born D'Urberville family, so she travels to their estate and meets the charming but dangerous Alec."},{"movieLink":"https://www.hmnow.com/films/gullivers_travels_1","imgLink":"https://d2eqr2grgdk9bg.cloudfront.net/v3/image/394403ddaf1863f7ab0655ee73758109.jpg?width=502","synopsis":"Based on Jonathan Swift's story, Lemuel Gulliver (Ted Danson) returns to his home to his wife (Mary Steenburgen) after being gone for years with unbelievable tales of a land filled with very tiny people and another with enormous giants."},{"movieLink":"https://www.hmnow.com/films/jack_and_the_beanstalk_1","imgLink":"","synopsis":"With puppets and effects from Jim Henson's Creature Shop, it's a modern update of the fairy tale where a businessman named Jack (Matthew Modine) discovers his ancestor really did climb a beanstalk to the land of the giants."},{"movieLink":"https://www.hmnow.com/films/journey_center_of_the_earth_1","imgLink":"","synopsis":"Based on the Jules Verne novel, geologist Theodore Lytton (Treat Williams) and his nephew Jonas (Jeremy London) are enlisted by a wealthy woman find her missing husband by venturing into a volcano to find a secret underground realm."},{"movieLink":"https://www.hmnow.com/films/in_the_beginning_1","imgLink":"","synopsis":"Abraham (Martin Landau) is called on to lead his followers to a new land, and passes his staff down through the generations."},{"movieLink":"https://www.hmnow.com/films/the_ten_commandments_part_one","imgLink":"","synopsis":"The story of Moses, from his narrow escape from death to his leadership of the Hebrew people to the parting of the Red Sea."},{"movieLink":"https://www.hmnow.com/films/noahs_ark_part_one","imgLink":"https://d2eqr2grgdk9bg.cloudfront.net/v3/image/e9b24284a6fedd17034fb48c3b503702.jpg?width=502","synopsis":"Noah and his three sons, Japheth, Shem and Ham, are instructed by God to build a huge boat that is large enough to hold two of every animal."},{"movieLink":"https://www.hmnow.com/films/incident_at_victoria_falls_1","imgLink":"https://d2eqr2grgdk9bg.cloudfront.net/v3/image/d27bc954777fd729f1e243844cfdac18.jpg?width=502","synopsis":"Holmes (Christopher Lee) and Watson (Patrick Macnee) are asked by the King to protect a diamond on route to South Africa, but a murderous thief is on their trail."},{"movieLink":"https://www.hmnow.com/films/leading_lady_1","imgLink":"https://d2eqr2grgdk9bg.cloudfront.net/v3/image/f96057a8d6998cb9521f90120d20767e.jpg?width=502","synopsis":"Sherlock (Christopher Lee) is tasked by his brother to travel to Vienna to recover stolen plans for a bomb, where he is reunited by the alluring Irene Adler (Morgan Fairchild)."},{"movieLink":"https://www.hmnow.com/films/heidi_part_1","imgLink":"https://d2eqr2grgdk9bg.cloudfront.net/v3/image/33e49a39a04f0572d855f3d8a65a186d.jpg?width=502","synopsis":"Young orphaned girl Heidi is sent to live with her gruff grandfather (Jason Robards) at his cabin in the Swiss Alps, where she eventually warms his embittered heart."}]