[{
    "movieLink": "https://www.hmnow.com/films/2_years_of_love",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/24ea7001d78a6bc6e48d0bcde3fc3616.jpg?width=502",
    "synopsis": "Samantha (Kayla Ewell) dispenses relationship advice on the radio, but she doesn't have the answer to her own problem: how to get her out-of-work husband John (Ryan Merriman) to agree that it's time to start a family of their own.",
    "duration": 5340
}, {
    "movieLink": "https://www.hmnow.com/films/4_wedding_planners",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/00ed210c08ac3fdb651e47e2bf49ecc5.jpg?width=502",
    "synopsis": "Lily (Kimberly Rose-Wolter) jets back to her Hawaiian hometown, where her mother Miriam (Illeana Douglas) runs a wedding planning business with her two other daughters, and the youngest is secretly dating Lily's ex-boyfriend Kai (Sung Kang).",
    "duration": 4560
}, {
    "movieLink": "https://www.hmnow.com/films/a_christmas_tree_miracle",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/dbd002b1b159e024634c37ca1d89a4f8.jpg?width=502",
    "synopsis": "When a father (Kevin Sizemore) loses his job, he and his whole family find themselves homeless right before the holidays, but then a kindhearted Christmas tree farmer offers to take them in.",
    "duration": 6180
}, {
    "movieLink": "https://www.hmnow.com/films/a_date_with_miss_fortune",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/2e06b62bf75805a0cd2666da479bcef5.jpg?width=502",
    "synopsis": "Jack (Ryan Scott) has a chance meeting with the beautiful Maria (Jeannette Sousa), but then things get in the way of their relationship, like her disapproving father and the psychic who says their love is doomed.",
    "duration": 5760
}, {
    "movieLink": "https://www.hmnow.com/films/a_family_reunion",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/8bb9e0315220aae274d8841a5489b103.jpg?width=502",
    "synopsis": "Desiree Banner (Brooke White) left the band she was in with her brothers for a solo career, but when her mom (Mercedes Ruehl) falls ill, Desiree will have to get the family back together for a 4th of July concert to raise money for their small town.",
    "duration": 5040
}, {
    "movieLink": "https://www.hmnow.com/films/a_fine_step",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/1f8f0789394e485d8c321f2a1a409e86.jpg?width=502",
    "synopsis": "When world champion rider Calvin Masterson (Luke Perry) has a debilitating accident on his favorite horse Fandango, his new neighbor Claire (Anna Claire Sneed) helps Calvin get back in the saddle again.",
    "duration": 6660
}, {
    "movieLink": "https://www.hmnow.com/films/a_gift_of_miracles",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/5424cef6ae506538cea5323459a0f9b2.jpg?width=502",
    "synopsis": "Darcy (Rachel Boston), a doctoral student working on her dissertation, happens upon a notebook belonging to her late mother, so with the encouragement of English professor Nathan (Jesse Moss), she attempts to connect the names in the book with the items her mother left behind.",
    "duration": 5040
}, {
    "movieLink": "https://www.hmnow.com/films/the_pledge",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/fd8fe4b9d80869d6853448ce22dd4b40.jpg?width=502",
    "synopsis": "Sheriff Matt Austin (Luke Perry) is out to bring down the gunman who killed his family, but when he runs afoul of a merciless land baron (C. Thomas Howell), he must help a woman and her son protect their ranch.",
    "duration": 5160
}, {
    "movieLink": "https://www.hmnow.com/films/a_long_way_off",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/ce7d167f46e6dddf70226fbf68afeb4f.jpg?width=502",
    "synopsis": "In an update on the parable of the Prodigal Son, Jake (Jason Burkey) has had it with life on the farm and asks for his inheritance to go off on his own, but when he loses everything his only hope lies in the forgiveness of family.",
    "duration": 6300
}, {
    "movieLink": "https://www.hmnow.com/films/a_mothers_gift",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/1bd5bb2c4c319be840e5314380d1a905.jpg?width=502",
    "synopsis": "After the Civil War, Abbie (Nancy McKeon) puts her dream of being an opera singer on hold to move to the Nebraskan frontier with her husband, Will (Adrian Pasdar), and raise their children on their sprawling farm.",
    "duration": 5820
}, {
    "movieLink": "https://www.hmnow.com/films/painthouse",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/3e9c0cdd0bb4540f55dd36701543b156.jpg?width=502",
    "synopsis": "Based on the John Grisham novel inspired by his youth, 10-year-old Luke (Logan Lerman) lives an idyllic life on an Arkansas farm with his father (Robert Sean Leonard) and grandfather (Scott Glenn) until he witnesses a brutal crime.",
    "duration": 5880
}, {
    "movieLink": "https://www.hmnow.com/films/placeforannie",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/d06bf65c64bd3d4f9ee73967d1ec9c9c.jpg?width=502",
    "synopsis": "A pediatric nurse (Sissy Spacek) fights to retain custody of Annie, an abandoned, HIV positive infant, after her birth mother (Mary-Louise Parker) reemerges.",
    "duration": 5940
}, {
    "movieLink": "https://www.hmnow.com/films/a_promise_kept_oksana_baiul",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/d1193975bf633c3cee78510364222882.jpg?width=502",
    "synopsis": "Russian figure skater Oksana Baiul (Monica Keena) lost both her parents at a young age, but with the guidance of a committed talent scout (Miguel Ferrer), she overcame tragedy and injuries to win Olympic gold.",
    "duration": 5580
}, {
    "movieLink": "https://www.hmnow.com/films/a_season_of_hope",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/23b00103ecd97d6b8c04433e8335cb12.jpg?width=502",
    "synopsis": "Elizabeth (JoBeth Williams) and Michael (Stephen Lang) are raising their two sons on their lemon grove, until a disease sweeps through their trees that threatens their livelihood and their family's entire future.",
    "duration": 5460
}, {
    "movieLink": "https://www.hmnow.com/films/smilemoon",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/eb12ecb4793e40f6563f830e02980d95.jpg?width=502",
    "synopsis": "A special education teacher (John Corbett) will stop at nothing to help his disabled students achieve their impossible dream of going to Space Camp.",
    "duration": 5700
}, {
    "movieLink": "https://www.hmnow.com/films/a_step_toward_tomorrow",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/9a53dcbcd3db25821fde4968464f8edd.jpg?width=502",
    "synopsis": "Anna Lynn (Judith Light) is a single mother desperate to find a treatment for her paralyzed son, moving cross-country to be near a spinal cord specialist (Tom Irwin), and getting advice from a quadriplegic man (Christopher Reeve).",
    "duration": 5580
}, {
    "movieLink": "https://www.hmnow.com/films/a_stranger_to_love",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/8b57b905b4eeab1507023d563deaeb59.jpg?width=502",
    "synopsis": "Inspired by a true story, Alan Grant (Beau Bridges) is attacked in a car-jacking and loses his memory, and while the family he doesn't remember believes that he is dead, he falls for a widow (Pam Dawber) raising two boys on her own.",
    "duration": 5520
}, {
    "movieLink": "https://www.hmnow.com/films/a_tale_of_two_cities",
    "imgLink": "",
    "synopsis": "Based on Charles Dickens' classic, two identical men (both played by Chris Sarandon) - one from England and one from France - fall for the same woman during the height of the French Revolution.",
    "duration": 9360
}, {
    "movieLink": "https://www.hmnow.com/films/a_valentine_carol",
    "imgLink": "",
    "synopsis": "Ally (Emma Caulfield) is a jaded talk radio host who dispenses cynical romance advice until a ghost visits to set her straight by showing her Valentine's Day past, present, and yet to come.",
    "duration": 5400
}, {
    "movieLink": "https://www.hmnow.com/films/a_way_back_home",
    "imgLink": "",
    "synopsis": "Inspired by Norman Rockwell's paintings, country singer Trey Cole (Austin Stowell) returns to the hometown he abandoned, and remembers the guidance he received as a boy from friendly barber Charlie Shuffleton (Danny Glover).",
    "duration": 5220
}, {
    "movieLink": "https://www.hmnow.com/films/a_wish_come_true",
    "imgLink": "",
    "synopsis": "On her 30th birthday, Lindsay (Megan Park) makes a wish that all of her previous birthday wishes could come true, but when that magically begins to happen, she realizes everything she really wanted was there all along.",
    "duration": 5160
}, {
    "movieLink": "https://www.hmnow.com/films/accidental_friendship",
    "imgLink": "",
    "synopsis": "Yvonne (Chandra Wilson) is a homeless woman who collects cans so she can take care of the dogs who mean everything to her, and she slowly develops a bond with a caring police officer (Kathleen Munroe) who also has a soft spot for pups.",
    "duration": 5220
}, {
    "movieLink": "https://www.hmnow.com/films/accidentally_engaged",
    "imgLink": "",
    "synopsis": "When she returns home for a friend's wedding, aspiring actress Clarissa (Lexi Giovagnoli) tells everyone she's dating movie star Chas Hunter (Brant Daugherty), only to be surprised when Chas shows up in town and needs her to pretend that they are engaged as a publicity stunt.",
    "duration": 5160
}, {
    "movieLink": "https://www.hmnow.com/films/aces_n_eights",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/7226961b01f1874d6efc6a309630020c.jpg?width=502",
    "synopsis": "When settlers on the frontier come under attack by a ruthless gang of criminals, it falls to an elderly ranch owner (Ernest Borgnine), a retired gunslinger (Casper Van Dien), and a resolute schoolteacher (Deirdre Quinn) to stand up for what is right.",
    "duration": 5220
}, {
    "movieLink": "https://www.hmnow.com/films/adventures_of_pepper_and_paula",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/d0a943fe9c212ed06221f172290c37c7.jpg?width=502",
    "synopsis": "Inspired by a true story, Pistol Packin' Paula (Mindy Raymond) is the star of a Wild West stunt show with her trusty pup, Pepper, but a new attention-grabbing costar and a near tragedy makes Paula wonder if it's time to hang up her spurs.",
    "duration": 5400
}, {
    "movieLink": "https://www.hmnow.com/films/against_her_will_an_incident",
    "imgLink": "",
    "synopsis": "Now residing in Maryland, Harmon Cobb (Walter Matthau) takes up the case of a Marika, a young woman who has been declared to be insane and committed to the state mental hospital, but Cobb questions the motives of the authorities.",
    "duration": 5640
}, {
    "movieLink": "https://www.hmnow.com/films/alice_in_wonderland",
    "imgLink": "",
    "synopsis": "Based on Lewis Carroll's classic novel, young Alice (Tina Majorino) falls down the rabbit hole into a strange world where she encounters the Cheshire Cat (Whoopi Goldberg), the Mad Hatter (Martin Short), and the Queen of Hearts (Miranda Richardson).",
    "duration": 8040
}, {
    "movieLink": "https://www.hmnow.com/films/all_roads_lead_home",
    "imgLink": "",
    "synopsis": "When 12-year-old Bella loses her mother in an accident, her father sends her to live with her grandfather (Peter Coyote) on his farm where she stands up for better treatment of the local animals.",
    "duration": 6720
}, {
    "movieLink": "https://www.hmnow.com/films/all_the_winters_that_have_been",
    "imgLink": "",
    "synopsis": "20 years after leaving Raven Island, Dane Corvin (Richard Chamberlain) returns home to care for his aging uncle (Hal Holbrook) and reconnect with Hannah (Karen Allen), the love he left behind.",
    "duration": 5640
}, {
    "movieLink": "https://www.hmnow.com/films/alls_fair_in_love_and_advertis",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/de7453f57d9d73fa7e3329e0d0043297.jpg?width=502",
    "synopsis": "Middle-aged ad exec Tom (Steven Weber) gets canned for being too out of touch, so he enlists the younger Dick (Andrew Francis) to take a job passing off Tom's ideas as his own, which works until inter-office romances threaten to spoil the charade.",
    "duration": 5220
}, {
    "movieLink": "https://www.hmnow.com/films/americanstory",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/8f978174d7e9b2c75952369b5e69c054.jpg?width=502",
    "synopsis": "(aka \"After the Glory\") When George (Brad Johnson) and his fellow WWII veterans return to their Texas hometown, they are stunned by the local government's rampant corruption and decide it is up to them to make a change.",
    "duration": 6000
}, {
    "movieLink": "https://www.hmnow.com/films/an_uncommon_grace",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/19bd583043fff1979d64824648bb06b3.jpg?width=502",
    "synopsis": "Army nurse Grace Conner (Jes Macallan) goes to stay with her grandmother (Kelly McGillis) on her farm in Ohio's Amish country, but she's pulled into duty when a neighbor (Sean Faris) needs help after a shooting, drawing Grace into a larger mystery.",
    "duration": 5040
}, {
    "movieLink": "https://www.hmnow.com/films/around_june",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/fa23abcaf2a6eb6480f01249bc987071.jpg?width=502",
    "synopsis": "June (Samaire Armstrong) is a quiet young woman living with her gruff father and her disabled uncle, until she meets a charming immigrant whose love helps her come out of her shell.",
    "duration": 5520
}, {
    "movieLink": "https://www.hmnow.com/films/at_home_in_mitford",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/7736d46ec7aeb8e1f5ac7156ea31f56f.jpg?width=502",
    "synopsis": "Cynthia (Andie MacDowell) is a children's book author dealing with writer's block and a broken heart, so she takes a trip to her uncle's cottage and runs into the town's priest (Cameron Mathison) who needs help getting through to a young orphan.",
    "duration": 5040
}, {
    "movieLink": "https://www.hmnow.com/films/august_creek",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/07c27b49a7dfb9ff1ac9cd9767e35cf4.jpg?width=502",
    "synopsis": "WORLD PREMIERE: Erica (Courtney Ford) left her Iowa hometown after she lost her soldier husband, but three years later she returns for her sister's wedding and has to face the love she left behind.",
    "duration": 5400
}, {
    "movieLink": "https://www.hmnow.com/films/away_and_back",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/77c985843532082c329c09af381fb8f3.jpg?width=502",
    "synopsis": "When a family of swans make their home on the Peterson farm, it sets up a clash between single dad Jack (Jason Lee) and Ginny (Minka Kelly), the plucky ornithologist who comes to protect the birds.",
    "duration": 5820
}, {
    "movieLink": "https://www.hmnow.com/films/baby_bootcamp",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/731d6052b5f6a8920c3ca7cdbf20209c.jpg?width=502",
    "synopsis": "Julia (Danneel Ackles), a fitness instructor struggling with her new business, volunteers to be a nanny for single dad Scott (Kavan Smith), despite the fact that she's never taken care of any kids before.",
    "duration": 5400
}, {
    "movieLink": "https://www.hmnow.com/films/back_to_christmas",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/102a27d6ad4049cad0f1495c33447875.jpg?width=502",
    "synopsis": "Facing the holidays by herself, heartbroken Ali (Kelly Overton) gets transported back in time one year for a second chance at keeping her relationship together.",
    "duration": 5100
}, {
    "movieLink": "https://www.hmnow.com/films/weweregrownups",
    "imgLink": "",
    "synopsis": "Rebecca (Blythe Danner) is a widowed grandmother in her 50s who suddenly feels that she doesn't like the person she's become, so she decides to remake herself and reconnect with a long-lost love.",
    "duration": 5880
}, {
    "movieLink": "https://www.hmnow.com/films/ballet_shoes",
    "imgLink": "",
    "synopsis": "Pauline (Emma Watson), Petrova, and Posy are three orphans living with a guardian who enrolls them in a school for acting and dancing, and they put their talents to use to earn money for the household.",
    "duration": 5100
}, {
    "movieLink": "https://www.hmnow.com/films/be_my_valentine",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/582a629bb2851ee1033e98410ddce917.jpg?width=502",
    "synopsis": "Dan (William Baldwin) is a firefighter and single dad who has given up on finding love, but when he answers an emergency call at a flower shop owned by the beautiful Kate (Natalie Brown), a new spark might just grow into a flame in time for Valentine's Day.",
    "duration": 5160
}, {
    "movieLink": "https://www.hmnow.com/films/beautiful_wave",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/86c24046d2930771c4e976a723e50480.jpg?width=502",
    "synopsis": "Nicole (Aimee Teegarden) is a teen from New York who goes to California to spend the summer with her grandmother (Patricia Richardson), where she learns surfing, falls in love, and uncovers a family secret.",
    "duration": 5760
}, {
    "movieLink": "https://www.hmnow.com/films/bed_and_breakfast",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/c4179dc1abb2832233ba27be86cfb4dc.jpg?width=502",
    "synopsis": "An American man (Dean Cain) and a Brazilian woman both believe they are the rightful heirs to a little B&B in California wine country, but they'll need to work together to keep it open.",
    "duration": 5520
}, {
    "movieLink": "https://www.hmnow.com/films/before_you_say_i_do",
    "imgLink": "",
    "synopsis": "George (David Sutcliffe) desperately wants to marry Jane (Jennifer Westfeldt), but she's hesitant after her first marriage to Doug (Jeff Roop), but all that history could change when an accident transports George a decade into the past to the days before Jane's first wedding.",
    "duration": 5280
}, {
    "movieLink": "https://www.hmnow.com/films/bertie_elizabeth",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/dc4a9192dcf497c29b4a5ef979b3052e.jpg?width=502",
    "synopsis": "The real-life love story between King George VI (James Wilby), nicknamed \"Bertie,\" and Elizabeth (Juliet Aubrey), from his surprising rise to the throne to rallying the country during World War II.",
    "duration": 5940
}, {
    "movieLink": "https://www.hmnow.com/films/beverly_lewis_the_reckoning",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/81ce80a902c5793020ce2d2b5ee36d26.jpg?width=502",
    "synopsis": "Kate Mayfield (Katie LeClerc) was adopted into an Amish family but inherited a fortune from her outsider biological mother, and now she finds herself torn between a love from her new world, and the man from her past she thought she had lost forever.",
    "duration": 5160
}, {
    "movieLink": "https://www.hmnow.com/films/beyondblackboard",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/6d47e459e62c88f448a3332c954fe6e8.jpg?width=502",
    "synopsis": "A young teacher (Emily VanCamp) is determined to transform a makeshift homeless shelter classroom into a warm environment where impoverished children can gain knowledge and self-respect.",
    "duration": 5820
}, {
    "movieLink": "https://www.hmnow.com/films/blindspot",
    "imgLink": "",
    "synopsis": "The perfect life of a congresswoman (Joanne Woodward) takes an unexpected turn after she discovers her daughter (Laura Linney), a new mother herself, is a drug addict.",
    "duration": 5940
}, {
    "movieLink": "https://www.hmnow.com/films/booky_makes_her_mark",
    "imgLink": "",
    "synopsis": "Life is tough during the Depression for the poor Thomson family, but youngest daughter Booky (Tatiana Maslany) is determined to become a writer, no matter who or what might stand in her way.",
    "duration": 5400
}, {
    "movieLink": "https://www.hmnow.com/films/bookys_crush",
    "imgLink": "",
    "synopsis": "11-year-old Beatrice (Rachel Marcus), aka \"Booky,\" is happy to tutor the new boy at school, but her mother (Megan Follows) is concerned he's not quite the dreamboat she thinks he is.",
    "duration": 5340
}, {
    "movieLink": "https://www.hmnow.com/films/breathing-lessons",
    "imgLink": "",
    "synopsis": "As they journey to a friend's funeral, down-to-earth Ira (James Garner) and his more emotional wife Maggie (Joanne Woodward) bicker, reminisce, and reaffirm their love.",
    "duration": 5880
}, {
    "movieLink": "https://www.hmnow.com/films/brush-with-fate",
    "imgLink": "",
    "synopsis": "Cornelia (Glenn Close) is an eccentric teacher who confides in her coworker Richard (Thomas Gibson) a deep secret: she possesses a priceless painting from the great artist Vermeer that has been passed down for three centuries.",
    "duration": 6000
}, {
    "movieLink": "https://www.hmnow.com/films/cab_to_canada",
    "imgLink": "",
    "synopsis": "Inspired by a true story, a Pasadena cabbie (Jason Beghe) picks up an elderly woman (Maureen O'Hara) on her way to a funeral, not knowing that she intends for him to drive her over 3,000 miles to Vancouver for the service.",
    "duration": 5400
}, {
    "movieLink": "https://www.hmnow.com/films/call_of_the_wild",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/1cdf0dddf6b9adfb5391ddc0217a4ab8.jpg?width=502",
    "synopsis": "Based on the Jack London novel, John Thornton (Rick Schroder) treks to Alaska to find his fortune in the Gold Rush, and befriends a brave and loyal sled dog named Buck.",
    "duration": 5820
}, {
    "movieLink": "https://www.hmnow.com/films/calmatsunset",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/d69ef7800984bafe247390822b85d86a.jpg?width=502",
    "synopsis": "Career fisherman Russell Pfeiffer (Michael Moriarty) struggled to afford to send his sons to college, so it shakes up the family when his youngest son James (Peter Facinelli) quits school to become a fisherman himself.",
    "duration": 5880
}, {
    "movieLink": "https://www.hmnow.com/films/can_you_feel_me_dancing",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/f5c6df0191a4dfb70b158cfa303763be.jpg?width=502",
    "synopsis": "Karin Nichols (Justine Bateman) is a headstrong 19-year-old who refuses to be held back by her blindness, and when she feels penned in by her overprotective family, she tries to gain independence with her new boyfriend.",
    "duration": 5700
}, {
    "movieLink": "https://www.hmnow.com/films/candlesbay",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/8a93dc69bce20b761b472698f011c01e.jpg?width=502",
    "synopsis": "Dee Dee (Alicia Silverstone), a single mother harboring a secret, returns to her hometown with her 11-year-old son, causing tensions between her old high-school sweetheart and his current wife.",
    "duration": 5820
}, {
    "movieLink": "https://www.hmnow.com/films/changing_hearts_2002",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/b8e1839daabfd5ae7cfbf7ac1af3aa04.jpg?width=502",
    "synopsis": "A sunny younger woman (Lauren Holly) and a grumpy older lady (Faye Dunaway) find themselves battling cancer together as well as meeting new men who offer a new chance at love.",
    "duration": 5580
}, {
    "movieLink": "https://www.hmnow.com/films/changing_hearts",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/d4a1ec3fd1c85f314d14cfefc0a4d6f4.jpg?width=502",
    "synopsis": "James (Brad Johnson) fled his family's bed-and-breakfast business after feuding with his brother Henry (Brian McNamara), but when their father gets ill, the two siblings must put aside their issues for the good of the family.",
    "duration": 5280
}, {
    "movieLink": "https://www.hmnow.com/films/chasing_grace",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/9c59e7979d7d9e740e6d8f077b03d4a5.jpg?width=502",
    "synopsis": "When an unspeakable tragedy upends a family, the bond between pastor Jonathan (Michael Joiner) and his brother (David Temple) is shattered, and everyone is forced to come to terms with their grief and learn to forgive.",
    "duration": 5820
}, {
    "movieLink": "https://www.hmnow.com/films/christmas_angel",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/f1b91165e57b75ac240c6e273129cfef.jpg?width=502",
    "synopsis": "Ashley really needs a job for the holiday season, so her reclusive neighbor Nick (Bruce Davison) offers her one helping him anonymously help people in need, but a handsome reporter starts to unravel their secret.",
    "duration": 5400
}, {
    "movieLink": "https://www.hmnow.com/films/christmas_in_conway",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/7eda8fef89beced145e072b44a2bdb43.jpg?width=502",
    "synopsis": "With his wife Suzy (Mary-Louise Parker) just home from the hospital, Duncan (Andy Garcia) is looking for a very special Christmas gift for her, and he finds it in a 45-foot-tall used Ferris wheel.",
    "duration": 5820
}, {
    "movieLink": "https://www.hmnow.com/films/christmas_tail",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/3130785c76f2a9157bd52c70bdc9df95.jpg?width=502",
    "synopsis": "A single mom (Chandra West) rescues a dog from the shelter as a gift for her son, not knowing it belongs to a girl and her single dad (Antonio Cupo), so the two families are forced to share the pup.",
    "duration": 5280
}, {
    "movieLink": "https://www.hmnow.com/films/citizen_jane",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/0148e3c8cda80052d8ff40885d64ed46.jpg?width=502",
    "synopsis": "Based on a true case, Jane Alexander (Ally Sheedy) is shocked by the murder of her beloved aunt, and she dedicates herself to working with a tenacious police detective to track down the killer.",
    "duration": 5280
}, {
    "movieLink": "https://www.hmnow.com/films/city_slacker",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/1d9cc5828a14c9f5e299f20d3cd61df3.jpg?width=502",
    "synopsis": "Amanda (Fiona Gillies) is a career-driven Londoner who is running out of time to have a child, but then she runs into Dan (Geoffrey Streatfield), a guy with few job prospects but who would make a great stay-at-home dad.",
    "duration": 5280
}, {
    "movieLink": "https://www.hmnow.com/films/civil_love",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/bb912bed832e609d24638ad122aa7cd8.jpg?width=502",
    "synopsis": "During the Civil War, Rachel (Elise Groves), the widow of a Union soldier, is trying to keep her family farm running, but when Daniel (DeMoyne Hunt), a wounded Confederate, takes shelter in her barn, she decides to protect him from those who are hunting him down.",
    "duration": 5460
}, {
    "movieLink": "https://www.hmnow.com/films/clover",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/4e366d888fdf4bc35975c744e5a893e9.jpg?width=502",
    "synopsis": "10-year-old Clover is being raised by her widower father (Ernie Hudson), but on the night of his wedding to Sara (Elizabeth McGovern) tragedy strikes, creating a rift between Clover's new stepmother and her aunt (Loretta Devine) over who should raise her.",
    "duration": 5460
}, {
    "movieLink": "https://www.hmnow.com/films/come_dance_at_my_wedding",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/dda50648bacc4dbf59a40210ceee0c57.jpg?width=502",
    "synopsis": "With her mother having recently passed and her wedding approaching, Cyd (Brooke Nevin) considers selling her mom's dance studio, but she'll need to get her biological father Tanner (John Schneider) to sign off on the deal, and he was never even told she was born.",
    "duration": 5280
}, {
    "movieLink": "https://www.hmnow.com/films/comeback_dad",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/3b6f9bbbcfdf60a7f3ebfce7bcd0b529.jpg?width=502",
    "synopsis": "After Othell (Charles S. Dutton) left his family, his daughter Nima (Tatyana Ali) struggled with trust issues, but now that she's about to get married, Othell wants to make amends for his mistakes and once again be a part of Nima's life.",
    "duration": 5280
}, {
    "movieLink": "https://www.hmnow.com/films/crossroads_2006",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/af58a2f317f2dd6e66e0d50a604a9ff1.jpg?width=502",
    "synopsis": "Peter (Jacob Pitts) is studying to be a Jesuit priest when he is sent to the Gulf Coast to work at a soup kitchen with an older priest (Alan Arkin) and Jill (Amy Acker), a beautiful volunteer who makes him rethink taking his vows.",
    "duration": 5160
}, {
    "movieLink": "https://www.hmnow.com/films/crossroads",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/170615b0415a57ab413fd77077ec00c5.jpg?width=502",
    "synopsis": "Based on a true story: Bruce Murakami (Dean Cain) is devastated when he loses his wife and daughter in a car accident, but when the teenage driver responsible goes to court, Bruce tries to channel his pain into a positive change.",
    "duration": 5640
}, {
    "movieLink": "https://www.hmnow.com/films/cupidcate",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/df0699acae2ffc0f543d5976c05ae660.jpg?width=502",
    "synopsis": "Cate (Mary-Louise Parker) is dealing with her disapproving father and over-achieving sisters when she meets the charming lawyer Harry (Peter Gallagher), but when she learns more about her new beau she realizes love is more complicated than she thought.",
    "duration": 5040
}, {
    "movieLink": "https://www.hmnow.com/films/daisies_in_december",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/2e9eacc8a4e3ca306abb7ab0108bd39d.jpg?width=502",
    "synopsis": "When his son takes his family away on vacation, lonely retiree Gerald (Joss Acklund) is sent to spend the holiday in a seaside hotel where he meets the mysterious Katharine (Jean Simmons) and a late-in-life romance develops until her secretive past comes to light.",
    "duration": 5820
}, {
    "movieLink": "https://www.hmnow.com/films/decoration_day",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/09631d700834051a83fd659fcc48d765.jpg?width=502",
    "synopsis": "Albert Finch (James Garner), a retired Georgia judge, is asked to represent an old friend who wants to refuse the Medal of Honor he earned during World War II because of the discrimination he experienced.",
    "duration": 5940
}, {
    "movieLink": "https://www.hmnow.com/films/derby",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/2060e1347fc5e6e312406d99d496cdd7.jpg?width=502",
    "synopsis": "When her father falls ill, Katie (Joanne Vannicola) returns to her family's horse farm with her new fiance, but Cass (David Charvet), the trainer she always had a crush on, is there and needs her help to get her favorite horse ready to race.",
    "duration": 5640
}, {
    "movieLink": "https://www.hmnow.com/films/duke",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/5b0df5fb1b3365b7ecebc20394093ba7.jpg?width=502",
    "synopsis": "Based on a true story, Terry Pulaski (Steve Weber) was a marine who was injured in Afghanistan and had trouble adjusting to life back with his wife and daughter, but a stray dog named Duke comes into his life and gives him a new mission to believe in.",
    "duration": 5220
}, {
    "movieLink": "https://www.hmnow.com/films/durango",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/5e2716009fee1555b1ba90e915257de6.jpg?width=502",
    "synopsis": "In 1930s Ireland, young Mark (Matt Keeslar), eager to prove himself to the father of Annie (Nancy St. Alban), the woman he loves, dares to lead a 40-mile cattle drive through the Irish countryside.",
    "duration": 6000
}, {
    "movieLink": "https://www.hmnow.com/films/dustbin_baby",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/d1493812f3ad0caff46ec72527dc4eaf.jpg?width=502",
    "synopsis": "After an argument with her foster mother Marion (Juliet Stevenson), 14-year-old April (Dakota Blue Richards) runs away to try to track down her biological mother who abandoned her as a newborn and disappeared.",
    "duration": 5400
}, {
    "movieLink": "https://www.hmnow.com/films/ellen-foster",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/b49f981ae78195a2bbfcf37e4a4a7ba7.jpg?width=502",
    "synopsis": "After her mother's death, Ellen Hammond (Jena Malone) is taken out of her abusive father's house and bounces from one temporary home to another as she searches for a real family she can call her own.",
    "duration": 5820
}, {
    "movieLink": "https://www.hmnow.com/films/emmas_wish",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/3d22b86e88d507d1bb4ea1bb7befb72d.jpg?width=502",
    "synopsis": "On her 75th birthday, lonely Emma (Joanna Kerns) makes a wish to be younger and then wakes up to find she's 35-years-old again, so she takes a job as the housekeeper for her grown daughter and young grandkids who don't recognize her.",
    "duration": 5460
}, {
    "movieLink": "https://www.hmnow.com/films/face_to_face",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/c04a8618ee685d4d9a9687b58de01ea3.jpg?width=502",
    "synopsis": "Diana (Elizabeth Montgomery), an American archeologist, and Tobias (Robert Foxworth), an English miner, clash over the right to dig in remote Kenya, but their conflict soon turns to romance.",
    "duration": 5580
}, {
    "movieLink": "https://www.hmnow.com/films/family_secrets",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/36aea80578e25e60eb31a1273593cb3c.jpg?width=502",
    "synopsis": "Maggie (Maureen Stapleton), her daughter Jessie (Stefanie Powers), and granddaughter Sara (Melissa Gilbert) spend the weekend together closing up the house after the death of Maggie's husband.",
    "duration": 5520
}, {
    "movieLink": "https://www.hmnow.com/films/firelight",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/874ca07b48c68ebc174985135bf0e14e.jpg?width=502",
    "synopsis": "Troubled young women in a correctional facility seek redemption through an elite firefighting program founded by a passionate counselor (Cuba Gooding Jr.).",
    "duration": 5760
}, {
    "movieLink": "https://www.hmnow.com/films/flying_by",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/9fef35634dceeb2892f9902c0dcd5316.jpg?width=502",
    "synopsis": "George Barron (Billy Ray Cyrus) attends his 25th high school reunion and is persuaded by his old bandmates to get up on stage, reviving his long-dormant passion for music, despite the disapproval of his wife (Heather Locklear).",
    "duration": 5700
}, {
    "movieLink": "https://www.hmnow.com/films/follow_the_river",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/b3d57797cef6d7714f79eedf21010662.jpg?width=502",
    "synopsis": "Mary Ingles (Sheryl Lee) and her husband Will (Tim Guinee) are raising two boys in the wilds of Virginia with another child on the way when she and the children are taken by a Shawnee war party, and she must escape to bring her children back to safety.",
    "duration": 5580
}, {
    "movieLink": "https://www.hmnow.com/films/followstars",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/2d6919a8dd48d100c96229133e2077e9.jpg?width=502",
    "synopsis": "Forced to choose between her unborn child and the man she loves, a young mother (Kimberly Williams-Paisley) struggles to raise a child with disabilities, learning along the way that she may be single, but she's not alone.",
    "duration": 5880
}, {
    "movieLink": "https://www.hmnow.com/films/for_love_and_honor",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/c5bdab92f4eb38b8b679ad313e51b57e.jpg?width=502",
    "synopsis": "Retired Col. Tom Brennan (James Denton) has trouble adjusting to civilian life, so he takes a job running the military academy he attended as a boy, which leads him to clash with the beautiful but unconventional Dean of Academics, Caroline (Natalie Brown).",
    "duration": 5160
}, {
    "movieLink": "https://www.hmnow.com/films/foxfire",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/1e52e12af9c34ab7339724e2e819b019.jpg?width=502",
    "synopsis": "Widowed Annie Nations (Jessica Tandy) takes care of her farm alone - except for her chats with her late husband (Hume Cronyn) - but when it looks like she could lose her land, she'll need her son (John Denver), a country-singing single dad, to come back home.",
    "duration": 6000
}, {
    "movieLink": "https://www.hmnow.com/films/freshman_father",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/587e9a9938de5bed8d3db68f5e408597.jpg?width=502",
    "synopsis": "Based on a true story, John Patton (Drew Seeley) was getting ready to go to college when he finds himself responsible for raising a child on his own, with only his understanding landlady (Annie Potts) to help him navigate both school and parenthood.",
    "duration": 5280
}, {
    "movieLink": "https://www.hmnow.com/films/from_time_to_time",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/ffbbd11730ac713465a7af539ee4d29d.jpg?width=502",
    "synopsis": "The creator of \"Downton Abbey\" wrote and directed this fantastical tale about an English boy sent to live with his grandmother (Maggie Smith) in her mysterious house filled with ghosts and doorways to the past.",
    "duration": 5760
}, {
    "movieLink": "https://www.hmnow.com/films/frontclass",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/3722c6e342d1e9a3d3f820a790813848.jpg?width=502",
    "synopsis": "Based on a true story, Brad Cohen (James Wolk), a young man with Tourette's Syndrome, fights to fulfill his dream of becoming a teacher with the help of his dedicated mother, Ellen (Patricia Heaton).",
    "duration": 6180
}, {
    "movieLink": "https://www.hmnow.com/films/get_to_the_heart_the_barbara_m",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/8d828d17d2dd1ba88ee4dcf33c4f408f.jpg?width=502",
    "synopsis": "Country music legend Barbara Mandrell recalls her life story, from a struggling young singer (Maureen McCormick) balancing her family life with performing with her sisters, to her recovery from a traumatic car accident.",
    "duration": 5520
}, {
    "movieLink": "https://www.hmnow.com/films/goodnight_for_justice",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/d7d796136344394e62f3a21001f8e409.jpg?width=502",
    "synopsis": "Having survived a brutal attack that killed his parents as a child, John Goodnight (Luke Perry) accepts a position as a circuit judge on the Wyoming frontier with the hope of tracking down the outlaws responsible.",
    "duration": 5280
}, {
    "movieLink": "https://www.hmnow.com/films/goodnight_for_justice_queen",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/e87e94ec6617f2e7fc319ae7cf57f5f1.jpg?width=502",
    "synopsis": "Judge John Goodnight (Luke Perry) rescues Lucy Truffaut (Katharine Isabelle) from a stagecoach attack, not knowing she is a con artist on the run, and the powerful Cyril Knox (Ricky Schroder) is dead-set on her going back to jail.",
    "duration": 5220
}, {
    "movieLink": "https://www.hmnow.com/films/goodnight_for_justice_measure",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/a6f1ca059c91bd94473d5e548bee252d.jpg?width=502",
    "synopsis": "Circuit judge John Goodnight (Luke Perry) stops in a small Wyoming town and witnesses a bank robbery by a gang of bandits, but Callie (Stefanie von Pfetten), a friendly local widow, reveals to Goodnight that the case is not as cut-and-dried as it seems.",
    "duration": 5220
}, {
    "movieLink": "https://www.hmnow.com/films/graceglorie",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/13511986b86baea2dbd3c8fc41560d97.jpg?width=502",
    "synopsis": "When a lonely New Yorker (Diane Lane) moves to the country to care for a terminally ill widow (Gena Rowlands), the two women begin an unexpected friendship that changes their lives.",
    "duration": 5940
}, {
    "movieLink": "https://www.hmnow.com/films/growing_the_big_one",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/958e00b491a5c6c3b2ffae38f2ce6255.jpg?width=502",
    "synopsis": "Seattle radio host Emma (Shannen Doherty) learns that her beloved late grandfather left her the family farm, a mountain of debt, and a batch of his famous pumpkin seeds, and with the help of Seth (Kavan Smith), her handsome new neighbor, she will turn over a new leaf.",
    "duration": 5280
}, {
    "movieLink": "https://www.hmnow.com/films/hannahs_law",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/d3d14fe0228a639bbc92183dcfd71919.jpg?width=502",
    "synopsis": "Bounty hunter Hannah Beaumont (Sara Canning) is out for frontier justice, tracking the gang of outlaws who killed her parents, but to bring them down she'll need the help of the legendary Wyatt Earp (Greyston Holt) and Doc Holliday (Ryan Kennedy).",
    "duration": 5220
}, {
    "movieLink": "https://www.hmnow.com/films/harvest-of-fire",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/f56b32aadd6e4cc056bc492451064be1.jpg?width=502",
    "synopsis": "FBI agent Sally Russell (Lolita Davidovich) is sent to investigate an arson in an isolated Amish community, but she must win the trust of widow Annie Beiler (Patty Duke), who has an innate distrust of outsiders.",
    "duration": 6000
}, {
    "movieLink": "https://www.hmnow.com/films/heart_felt",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/48414f1b40027ecd1d4e37dca372fb82.jpg?width=502",
    "synopsis": "A year after leaving her boyfriend and her hometown, Molly (Emmanuelle Vaugier) has a new job and a new relationship, but when she tries to buy a vineyard she suddenly finds herself having to deal with her ex.",
    "duration": 5400
}, {
    "movieLink": "https://www.hmnow.com/films/heart_the_marilyn_bell_story",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/3ed4466312fcf9aaabcbbda2c12a7d13.jpg?width=502",
    "synopsis": "The remarkable true story of Marilyn Bell (Caroline Dhavernas), a Canadian teenager who made history as the first person to swim across Lake Ontario in a 21-hour marathon race.",
    "duration": 5460
}, {
    "movieLink": "https://www.hmnow.com/films/heaven_is_waiting",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/20dc7de1faa2313b27083481327bd588.jpg?width=502",
    "synopsis": "Ned (Curt Doussett) still hasn't gotten over losing his wife - in fact, he still talks to her for advice - but when his daughter Liz (Brittany Peltier) comes home from college with a new boyfriend, he has to re-examine how he thinks about love.",
    "duration": 4800
}, {
    "movieLink": "https://www.hmnow.com/films/heavens_door",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/fb44805cde0b9b401f59346c703f8ee1.jpg?width=502",
    "synopsis": "Heartbroken by the death of her grandfather and the separation of her parents (Dean Cain and Charisma Carpenter), 12-year-old Riley discovers an otherworldly portal which gives her the power to heal, but it comes at a price.",
    "duration": 5880
}, {
    "movieLink": "https://www.hmnow.com/films/holy_joe",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/65b21f9dcc2e8eeb0fd7c6e42b1dd743.jpg?width=502",
    "synopsis": "Reverend Joe Cass (John Ritter) is an Episcopalian priest and volunteer firefighter who is in the midst of a crisis of faith when he gets called to a dangerous blaze and witnesses an apparent miracle.",
    "duration": 5400
}, {
    "movieLink": "https://www.hmnow.com/films/homecoming",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/838756e313f4ac7cccdd066892e1e626.jpg?width=502",
    "synopsis": "After four children are abandoned by their mother at a shopping mall, they make their way to the home of their grandmother Abigail (Anne Bancroft), a lonely woman haunted by her past, and together they forge a new family.",
    "duration": 6300
}, {
    "movieLink": "https://www.hmnow.com/films/horse_camp",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/f90174175f972c2f7be8384aeebe5f8f.jpg?width=502",
    "synopsis": "Shy 17-year-old Kathy (Jordan Trovillion) is the daughter of former rodeo stars, but her mother has forbidden her to ride after father (Dean Cain) was injured in an accident, but then she gets the opportunity to spend the summer learning the rope at a riding camp.",
    "duration": 6420
}, {
    "movieLink": "https://www.hmnow.com/films/how_to_fall_in_love",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/d260140cc44c9ce309486ad0929c5ba0.jpg?width=502",
    "synopsis": "Harold (Eric Mabius) never got over being the nerdy kid, so now that he's a successful accountant he hires Annie (Brooke D'Orsay) -- the most popular girl at his school and his teenage crush -- to be his dating coach, which helps spark his confidence and his old flame for her.",
    "duration": 5220
}, {
    "movieLink": "https://www.hmnow.com/films/how_to_train_your_husband",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/c54ce5a0e3897aa954c3e9da208ad1c8.jpg?width=502",
    "synopsis": "Jillian (Julie Gonzalo) is a marriage therapist with a popular self-help book, but her own marriage to Justin (Jonathan Chase) is in trouble, so while he's away on a trip, Jillian's friend encourages her to take in a foster puppy, which gives her a new perspective on life and love.",
    "duration": 5160
}, {
    "movieLink": "https://www.hmnow.com/films/i_am_potential",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/74cb074d684187909ba36c0205c60643.jpg?width=502",
    "synopsis": "Based on a true story: Patrick Henry Hughes was born blind and without the ability to walk, but with the help of his dedicated father (Burgess Jenkins), he will fulfill his dream of playing with the university marching band.",
    "duration": 5640
}, {
    "movieLink": "https://www.hmnow.com/films/i_think_i_do",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/6284e32675bd3e2ebb8a045b60662b2e.jpg?width=502",
    "synopsis": "After event planner Julia (Mia Kirshner) gets left at the altar on her own \"perfect\" wedding day, she will need the support of her sisters if she's ever going to believe in love again.",
    "duration": 5520
}, {
    "movieLink": "https://www.hmnow.com/films/in_a_class_of_his_own",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/90a6220b1133111064d81caaecfa3825.jpg?width=502",
    "synopsis": "Based on a true story, Rich Donato (Lou Diamond Phillips) is the much-loved janitor of an Oregon high school, but when he learns he needs a diploma of his own to keep his job, the teachers and students rally to his aid.",
    "duration": 5640
}, {
    "movieLink": "https://www.hmnow.com/films/in_from_the_night",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/2d91793eb98554d5905f87d866496f75.jpg?width=502",
    "synopsis": "Vicki (Marcia Gay Harden), a single, struggling writer, must put her career on hold to take care of her troubled teenage nephew after he runs away from his abusive parents.",
    "duration": 5820
}, {
    "movieLink": "https://www.hmnow.com/films/lovewar",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/b67392c065c3044c108cd25358100b65.jpg?width=502",
    "synopsis": "Based on a true WWII story: British officer Eric Newby (Callum Blue) was injured, alone, and stranded behind enemy lines in Italy until a young local woman, Wanda (Barbora Bobulova), risked everything to protect him from the German army.",
    "duration": 5940
}, {
    "movieLink": "https://www.hmnow.com/films/in_my_dreams",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/0560c823d7bf99d6fc2dadfddd5eeaf0.jpg?width=502",
    "synopsis": "After tossing coins in a special fountain, Natalie (Katherine McPhee) and Nick (Mike Vogel) begin to dream of each other. Now they have seven days to find each other and make their wishes come true.",
    "duration": 5640
}, {
    "movieLink": "https://www.hmnow.com/films/incident_in_a_small_town",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/2943c9d4233b3b4a7eaca324ed38e1fe.jpg?width=502",
    "synopsis": "Harmon Cobb (Walter Matthau) is called upon by his old friend Judge Bell (Harry Morgan) to defend him for the crime of killing the abusive husband of Bell's estranged daughter (Stephanie Zimbalist).",
    "duration": 5580
}, {
    "movieLink": "https://www.hmnow.com/films/journey",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/7e8f58983a8a954c8e30fa408a811095.jpg?width=502",
    "synopsis": "Journey is the name of an 11-year-old boy who is abandoned by his mother and turns to his grandfather (Jason Robards), an amateur photographer, to help comes to terms with why she left him behind.",
    "duration": 5940
}, {
    "movieLink": "https://www.hmnow.com/films/journey_of_the_heart",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/7a674103206217418a2bd072f9489a1c.jpg?width=502",
    "synopsis": "Single mother Janice (Cybill Shepherd) is trying to raise two young sons - Tony, who is autistic, and Ray the troublemaker - in a judgmental small town, but she discovers Tony has a natural gift for music which she fosters with the help of a caring teacher (Stephen Lang).",
    "duration": 5520
}, {
    "movieLink": "https://www.hmnow.com/films/just_the_way_you_are",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/2b5150280c83a44f57939accfc06d498.jpg?width=502",
    "synopsis": "Jennie (Candace Cameron Bure) is a professional matchmaker who makes a living by helping people find love, but when the spark goes out of her marriage to Ian (Ty Olsson), she convinces him to go on a \"blind date\" with each other to restart their romance.",
    "duration": 5100
}, {
    "movieLink": "https://www.hmnow.com/films/a_time_to_dance",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/ca85376f7c62db9bf6da544bfbe04156.jpg?width=502",
    "synopsis": "John (Dan Payne) and Abby (Jennie Garth) were high school sweethearts who have come to the painful decision to split up, but when their daughter surprises them with the news that she's getting married, they put off the divorce until after the wedding.",
    "duration": 5160
}, {
    "movieLink": "https://www.hmnow.com/films/kiss_at_pine_lake",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/6dda6803013e57413be780a1c6fe8aa1.jpg?width=502",
    "synopsis": "As teens, Zoe and Luke nearly had their first kiss at Camp Pine Lake, but now that they are adults, Zoe (Mia Kirshner) is tasked with getting the new owner of the camp to sell the land, not knowing that it belongs to her old crush, Luke (Barry Watson).",
    "duration": 5220
}, {
    "movieLink": "https://www.hmnow.com/films/lake_effects",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/d0535af29a5f04dfffcc7f0c053f876a.jpg?width=502",
    "synopsis": "After their father dies in an accident, grown sisters Sara (Scottie Thompson) and Lily (Madeline Zima) return home to help their mother Vivian (Jane Seymour) make funeral arrangements and consider where the future will take them.",
    "duration": 6000
}, {
    "movieLink": "https://www.hmnow.com/films/cider_with_rosie",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/4e0f2f06e8da6c5a492b38c386e506ac.jpg?width=502",
    "synopsis": "Inspired by the life of writer Laurie Lee, a young boy grows up in the English countryside at the end of World War I with the help and guidance of his protective mother, Annie (Juliet Stevenson).",
    "duration": 5940
}, {
    "movieLink": "https://www.hmnow.com/films/life_inside_out",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/4830f2a082a68f59828ffee8e64299f2.jpg?width=502",
    "synopsis": "When her business shuts down, married mother Laura (Maggie Baird) returns to her passion for music, and it opens up a surprising new connection with her withdrawn 14-year-old son, Shane (Finneas O'Connell).",
    "duration": 6120
}, {
    "movieLink": "https://www.hmnow.com/films/like_a_country_song",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/7b4be519d3f450255205e6981fbf37aa.jpg?width=502",
    "synopsis": "Jake (Joel Smallbone), a young country music singer with self-destructive tendencies, discovers that his father, Bo (Billy Ray Cyrus), did not die in an accident like Jake's mother claimed and now wants to reconnect with his long-lost son.",
    "duration": 6120
}, {
    "movieLink": "https://www.hmnow.com/films/listen_to_your_heart",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/7d93a2f566cb61744fb967cede978bdf.jpg?width=502",
    "synopsis": "Danny (Kent Moran), a struggling singer/songwriter, falls in love with Ariana (Alexia Rasmussen), a wealthy young woman who cannot hear and is torn between her new romance and her disapproving mother (Cybill Shepherd).",
    "duration": 6000
}, {
    "movieLink": "https://www.hmnow.com/films/littlejohn",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/cb6f04931292a91a7cda83f61427aff1.jpg?width=502",
    "synopsis": "Natalie (Gloria Reuben), a successful family court judge, reconnects with her estranged father John (Ving Rhames) after his health starts to fail, only to discover he's been raising the child she gave up for adoption twelve years earlier.",
    "duration": 5880
}, {
    "movieLink": "https://www.hmnow.com/films/little_men",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/ca526dc36e98e6b0214b5bb2f6edb2fa.jpg?width=502",
    "synopsis": "Jo March (Mariel Hemingway) has grown up and married Fritz Bhaer (Chris Sarandon), and together they run a school for orphans, but a troublesome young boy named Dan might be too much for them to handle.",
    "duration": 5880
}, {
    "movieLink": "https://www.hmnow.com/films/lone_rider",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/9316f34074545b5d650341ff66856df7.jpg?width=502",
    "synopsis": "Bobby Hattaway (Lou Diamond Phillips) returns to the West after the Civil War to learn that the crooked Stu Croaker (Vincent Spano) has strong-armed the county and is aiming to take the family business from him and his father (Stacy Keach).",
    "duration": 4980
}, {
    "movieLink": "https://www.hmnow.com/films/long_life_happiness_and_prospe",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/ba11ffca50031022d2eafd5d00859def.jpg?width=502",
    "synopsis": "With her single mother (Sandra Oh) struggling both financially and romantically, a 12-year-old girl tries using magical charms to fix her mom's problems. In English and Cantonese.",
    "duration": 5520
}, {
    "movieLink": "https://www.hmnow.com/films/love_birds",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/df92d26b8df55997dd2a9694d770d2b1.jpg?width=502",
    "synopsis": "A heartbroken guy (Rhys Darby) rescues an injured duck from his roof, so he seeks help in caring for the little quacker from a sweet zoologist (Sally Hawkins) and her son.",
    "duration": 6120
}, {
    "movieLink": "https://www.hmnow.com/films/love_by_design",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/204dbe88076e40f128fa49c046666cbe.jpg?width=502",
    "synopsis": "After she is fired from her fashion job by her high-powered boss (Jane Seymour), Danielle (Giulia Nahmany) returns to her small hometown in Eastern Europe where she finds love and the opportunity to redesign her life.",
    "duration": 5340
}, {
    "movieLink": "https://www.hmnow.com/films/love_finds_you_in_valentine",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/e88205a9159216e9986e0264e0234fa9.jpg?width=502",
    "synopsis": "Kennedy (Michaela McManus) fulfills her father's last request and returns to her family's Nebraska ranch before it's due to be sold, which gives her the chance to connect with the grandfather (Ed Asner) she never knew and get close to the handsome ranch foreman (Diogo Morgado).",
    "duration": 5460
}, {
    "movieLink": "https://www.hmnow.com/films/love_under_the_stars",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/959cf7a2410f57f57a7fe4744dcbafb9.jpg?width=502",
    "synopsis": "Grad student Becca (Ashley Newbrough) is tasked by her faculty advisor (Barry Bostwick) to get to know Emily, a withdrawn girl who recently lost her mother, and in the process she develops a bond with Emily's grieving father, Nate (Wes Brown).",
    "duration": 5040
}, {
    "movieLink": "https://www.hmnow.com/films/loves_kitchen",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/cc132d8e32c16c905c41cb2d5025ee2c.jpg?width=502",
    "synopsis": "Rob (Dougray Scott), a widowed chef, takes some advice from his pal Gordon Ramsey to ditch London and set up a new restaurant in a small village, where he runs into a beautiful and opinionated American food critic (Claire Forlani).",
    "duration": 5400
}, {
    "movieLink": "https://www.hmnow.com/films/lovingleah",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/576e3b9ad5489274999346d638788c14.jpg?width=502",
    "synopsis": "When Leah (Lauren Ambrose), a young Orthodox Jewish woman, is widowed by her rabbi husband, an old religious law dictates she must either denounce him, or marry his younger brother, Jake (Adam Kaufman).",
    "duration": 5820
}, {
    "movieLink": "https://www.hmnow.com/films/lyfes_journey",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/9d382c602043a758f7e18af866d99be1.jpg?width=502",
    "synopsis": "David Lyfe (Keith Robinson) is a married bank manager who has a serious lapse in judgment that leads to him losing his job and his family, but a compassionate preacher (Richard T. Jones) helps set him on the right path.",
    "duration": 4920
}, {
    "movieLink": "https://www.hmnow.com/films/mail_order_bride",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/0e81a80ff53739d5b722c5a3aa528585.jpg?width=502",
    "synopsis": "Diana McQueen (Daphne Zuniga) is a con artist who hatches a plan to get out from under her hard-nosed mentor (Greg Evigan) by taking another woman's place in an arranged marriage with an unsuspecting cowboy (Cameron Bancroft).",
    "duration": 5280
}, {
    "movieLink": "https://www.hmnow.com/films/mayor_cupcake",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/a9d19c55c2e476ac7346b85280edefe8.jpg?width=502",
    "synopsis": "Mary (Lea Thompson) has the best bakery in town, but when her daughter secretly puts her name on the ballot for mayor, she ends up running her troubled small town.",
    "duration": 5160
}, {
    "movieLink": "https://www.hmnow.com/films/meddling_mom",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/1d95a5ad7d988bdba5cc23b848706f92.jpg?width=502",
    "synopsis": "Carmen Vega (Sonia Braga) is notorious for getting too involved in her grown daughters' domestic and romantic lives, so the two hatch a plan to get their mother a love life of her own.",
    "duration": 5100
}, {
    "movieLink": "https://www.hmnow.com/films/meet_my_valentine",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/04614a746b69844ac9ea988962b01ef3.jpg?width=502",
    "synopsis": "After Tom (Scott Wolf) receives a terminal diagnosis, he decides to screen potential suitors for his wife Valentine (Courtney Ford) to find her a match before he's gone.",
    "duration": 5340
}, {
    "movieLink": "https://www.hmnow.com/films/mermaid",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/34ebe6a1f8af39aae38c113e2381fa70.jpg?width=502",
    "synopsis": "Desi is a young girl who still hasn't processed her father's death, despite the best efforts of her mother Rhonda (Samantha Mathis), so her grandmother Trish (Ellen Burstyn) encourages the child to write a letter and send it away on a balloon.",
    "duration": 5640
}, {
    "movieLink": "https://www.hmnow.com/films/midnight_masquerade",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/ea629f3c16f69dd9fe719e688aa1fc51.jpg?width=502",
    "synopsis": "Elyse Samford (Autumn Reeser) is about to inherit her father's gigantic candy corporation, and Rob (Christopher Russell) is a young lawyer who falls for her, but it will take a masked Halloween ball to bring them together and save the company.",
    "duration": 4920
}, {
    "movieLink": "https://www.hmnow.com/films/midnight_stallion",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/56e0418a2a61827d7ac3cc84c6cd605c.jpg?width=502",
    "synopsis": "When Jack (Kris Kristofferson) needs money to save his farm, his teenage daughter Megan (Jodelle Ferland) adopts a wild horse and trains it to compete in a high-stakes race.",
    "duration": 5400
}, {
    "movieLink": "https://www.hmnow.com/films/misspieces",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/6c7fb3c9eac54590d2a11e67063bd889.jpg?width=502",
    "synopsis": "Rancher Atticus Cody (James Coburn) travels to Mexico to claim the body of his estranged son, but as he unravels the clues surrounding his son's apparent suicide, he realizes that it may have actually been murder.",
    "duration": 6000
}, {
    "movieLink": "https://www.hmnow.com/films/moms_day_away",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/bcf89dbbcda0590df4c84e49e19f260e.jpg?width=502",
    "synopsis": "Laura Miller (Bonnie Somerville) is a married mother of two who feels unappreciated by her family, so for Mother's Day she skips town with her unmarried friend for a girls' weekend out.",
    "duration": 4920
}, {
    "movieLink": "https://www.hmnow.com/films/mom_murder_and_me",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/6408768380099061f3290e6495444401.jpg?width=502",
    "synopsis": "When Annabel (Sarah Klaren) learns her neighbor passed away, her overly suspicious mother, Joan (Kathy Garver), insists it was murder, and the pair of amateur detectives end up combing San Francisco for clues to this mystery.",
    "duration": 5520
}, {
    "movieLink": "https://www.hmnow.com/films/mothers_of_the_bride",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/dc5d29b222aef9e53d82d3bd58906af0.jpg?width=502",
    "synopsis": "As she prepares for her wedding, Jenna (Daniela Bobadilla) tells her adopted mother Debra (Gail O'Grady) she'd like to finally meet her birth mother, Haley (Betsy Brandt), but the two moms clash over the best approach to their daughter's big day.",
    "duration": 5280
}, {
    "movieLink": "https://www.hmnow.com/films/mr_hockey_gordie_howe_story",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/33cab61c8bca4fd7a120f9ca2491e10c.jpg?width=502",
    "synopsis": "Gordie Howe (Michael Shanks) was a hockey legend who retired from the sport after 25 years on the ice, but then two years later he shocked the world by returning to the sport and becoming the teammate of his two grown sons.",
    "duration": 5220
}, {
    "movieLink": "https://www.hmnow.com/films/mrs_washington_goes_to_smith",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/47468552ac5dbcc41db8efd362b6b76a.jpg?width=502",
    "synopsis": "Newly divorced Alice Washington (Cybill Shepherd) wants to restart her life, so she enrolls in college to finish her degree, where she gets paired up with a pink-haired roommate and becomes the oldest basketball player in the school's history.",
    "duration": 5280
}, {
    "movieLink": "https://www.hmnow.com/films/murder_101_wishes_were_horses",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/79fd5e1dae9b293c0509b6d65d661673.jpg?width=502",
    "synopsis": "Mike Bryant (Barry Van Dyke) learns that his friend's prize racehorse has been kidnapped, so he enlists Professor Jonathan Maxwell (Dick Van Dyke) to uncover who stole the thoroughbred and set a deadly fire.",
    "duration": 5040
}, {
    "movieLink": "https://www.hmnow.com/films/murder_101_locked_room_mystery",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/7ac518791e2e15b6c5c57f894998a080.jpg?width=502",
    "synopsis": "Samuel (Charles Shaughnessy) is a new age healer who is murdered while inside a locked \"meditation chamber,\" so it's up to Professor Jonathan Maxwell (Dick Van Dyke) and Mike Bryant (Barry Van Dyke) to figure out both who did it, and how.",
    "duration": 5160
}, {
    "movieLink": "https://www.hmnow.com/films/my_brothers_wife",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/858539f2e9ee415f3823103bfa32c187.jpg?width=502",
    "synopsis": "Barney (John Ritter) returns home to Boston for his father's funeral and is met by Eleanor (Mel Harris), who is married to his brother, and they recall their on-again/off-again relationship over the past three decades.",
    "duration": 5700
}, {
    "movieLink": "https://www.hmnow.com/films/my_dads_a_soccer_mom",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/ea35cc0be791e36919cba9667df1865e.jpg?width=502",
    "synopsis": "Marion \"Mad Dog\" Casey (Lester Speight) is a pro football player who gets dropped from his team and suddenly finds himself taking care of his 10-year-old daughter, and the two connect to each other when she shows her skills on the soccer field.",
    "duration": 4920
}, {
    "movieLink": "https://www.hmnow.com/films/my_first_love",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/491c6615e1db81701be303b24791e5a3.jpg?width=502",
    "synopsis": "Carmen (Gabrielle Dennis) is fed up that her husband Omar (Pooch Hall) pays more attention to his smartphone, his text messages, and his social media update than he does to her, so she eventually has to draw the line and say that either the phone goes, or she does.",
    "duration": 5280
}, {
    "movieLink": "https://www.hmnow.com/films/my_mothers_future_husband",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/25bdf7fd29901f49aebb548c3f45fe00.jpg?width=502",
    "synopsis": "15-year-old Headly (Matreya Fedor) and her widowed mom Rene (Lea Thompson) are total BFFs, so Headly decides it's time for her mom to get back out into the dating pool and conspires with her pal to find Rene a new man.",
    "duration": 5340
}, {
    "movieLink": "https://www.hmnow.com/films/my_own_love_song",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/9040bbd2e7180c4763ac53143f60c4a3.jpg?width=502",
    "synopsis": "Jane (Renee Zellweger), a wheelchair-bound former country singer, and Joey (Forest Whitaker), a damaged soul who sees angels, join up on a road trip from Kansas to New Orleans.",
    "duration": 6120
}, {
    "movieLink": "https://www.hmnow.com/films/sisterskeeper",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/b56571a5b9e9b8d7b7ecc5004b4740b9.jpg?width=502",
    "synopsis": "When their mother dies, a career-minded New Yorker (Elizabeth Perkins) is appointed trustee of her older sister (Kathy Bates), who suffers from a debilitating psychiatric disorder.",
    "duration": 6420
}, {
    "movieLink": "https://www.hmnow.com/films/nearlyweds",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/6a63cecdda0d14c9e64ea22b9a97d8c2.jpg?width=502",
    "synopsis": "Three best friends - Erin (Danielle Panabaker), Casey (Jessica Parker Kennedy) and Stella (Britt Irvin) - learn that the paperwork for their recent weddings was misfiled and they still aren't legally married, giving them each a second chance to consider if they've made the right choice.",
    "duration": 5220
}, {
    "movieLink": "https://www.hmnow.com/films/never_too_late",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/87f94032a1aba3d5cb86516a076888a4.jpg?width=502",
    "synopsis": "Rose (Olympia Dukakis) and Olive (Cloris Leachman), two ladies living in a retirement home, discover their late friend's money has vanished, so they team up to unravel the scam.",
    "duration": 5760
}, {
    "movieLink": "https://www.hmnow.com/films/nightridehome",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/9d007fa7d0516edda290bbf05db29a3d.jpg?width=502",
    "synopsis": "Neal (Keith Carradine) and Nora (Rebecca De Mornay) are a married couple who run a horse ranch who have been drifting apart, but when tragedy strikes, they realize the only way they can move forward is together.",
    "duration": 5880
}, {
    "movieLink": "https://www.hmnow.com/films/rockwell_breaking_home_ties",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/c7710f95453f34803250958a3dc14b90.jpg?width=502",
    "synopsis": "Inspired by a painting, Lonnie (Doug McKeon) says goodbye to his parents Lloyd (Jason Robards) and Emma (Eva Marie Saint) and he heads off to college, but when he comes home for Thanksgiving everything has changed.",
    "duration": 5460
}, {
    "movieLink": "https://www.hmnow.com/films/northanger_abbey",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/c7003e00c830c91a6ff454379bbef9a5.jpg?width=502",
    "synopsis": "Based on Jane Austen's novel, teenage Catherine (Oscar-nominee Felicity Jones) visits family friends at their manor, but her overactive imagination begins to confuse real life with the drama in her books.",
    "duration": 5580
}, {
    "movieLink": "https://www.hmnow.com/films/notes_from_the_heart_healer",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/e91bb291ec690c646192745e3f7ded3d.jpg?width=502",
    "synopsis": "Peyton (Genie Francis) and King (Ted McGinley) decide to get away for their first anniversary to a remote cottage, only to find an infant abandoned at the doorstep, so Peyton attempts to track down the baby's birth mother while struggling with the instinct to keep the child as her own.",
    "duration": 5160
}, {
    "movieLink": "https://www.hmnow.com/films/oldman",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/2d86fa21bad888341be78c6c840ab49a.jpg?width=502",
    "synopsis": "Based on the story by William Faulkner about a convict (Arliss Howard) who rescues a pregnant woman (Jeanne Tripplehorn) from the great Mississippi flood of 1927.",
    "duration": 5820
}, {
    "movieLink": "https://www.hmnow.com/films/once_upon_a_winters_date",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/6334cdc52530a7130c5c7507700c4e67.jpg?width=502",
    "synopsis": "WORLD PREMIERE: Katherine (Nicky Whelan), a career-minded ad executive, endures the worst Valentine's Day date of her life, only to wake up and find she has been cursed to relive the same day over and over until she finally finds her true love.",
    "duration": 4200
}, {
    "movieLink": "https://www.hmnow.com/films/our_wild_hearts",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/2800f2cd2c18c666d44c4bad26773a15.jpg?width=502",
    "synopsis": "Teenage Willow (Cambrie Schroder) leaves her home in Malibu to track down Jack (Rick Schroder), the father she's never known, and on his ranch she develops a bond with a special mustang named Bravo.",
    "duration": 5340
}, {
    "movieLink": "https://www.hmnow.com/films/perfectly_prudence",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/ef845719a083acede17784b756ec3959.jpg?width=502",
    "synopsis": "Prudence MacIntyre (Jane Seymour) is asked to make changes to her successful television show when the network sends in new producers to revamp her image, and it turns out one executive (Joe Lando) is her old flame.",
    "duration": 5160
}, {
    "movieLink": "https://www.hmnow.com/films/picnic",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/a35912f4191202a5fdfd072a0e68c474.jpg?width=502",
    "synopsis": "Based on the Pulitzer Prize-winning play, a drifter (Josh Brolin) comes to town on Labor Day to visit his old pal, only to fall in love with his friend's fiancee (Gretchen Mol).",
    "duration": 5700
}, {
    "movieLink": "https://www.hmnow.com/films/holliswoods",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/5921a575891612297a92f0bb7e6d38c3.jpg?width=502",
    "synopsis": "12-year-old Hollis Woods finally finds a foster home she likes when she moves in with retired teacher Josie Cahill (Sissy Spacek), but when Josie begins exhibiting signs of Alzheimer's Disease, Hollis fears their days together may be numbered.",
    "duration": 5760
}, {
    "movieLink": "https://www.hmnow.com/films/plainsong",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/ac012e1e87b607b3a04ce835dfb055e4.jpg?width=502",
    "synopsis": "A high school history teacher (Aidan Quinn) faced with raising his two young sons alone in a small Colorado town finds his life becoming intertwined with a pregnant 17-year-old student (America Ferrera).",
    "duration": 6300
}, {
    "movieLink": "https://www.hmnow.com/films/poldark",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/a1f296f18935f527f3b411db344e7e9c.jpg?width=502",
    "synopsis": "Jeremy (Ioan Gruffudd), the son of the famed Captain Ross Poldark (John Bowe), rescues a stranger from a shipwreck and takes him in, where he falls for the family's eldest daughter, but her mother suspects he is hiding something.",
    "duration": 6180
}, {
    "movieLink": "https://www.hmnow.com/films/prairie_fever",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/2fee73dded2c21e1fcb93dbe103e88a3.jpg?width=502",
    "synopsis": "Preston Biggs (Kevin Sorbo) is a former lawman driven to drink by the loss of his wife who is given a chance to pay off his saloon debt by shepherding three unhinged women to the train back East, but along the way he finds another woman on the run who also needs his help.",
    "duration": 4920
}, {
    "movieLink": "https://www.hmnow.com/films/princess_kaiulani",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/3c281fb9f2c1fca320daa8aacfe40fba.jpg?width=502",
    "synopsis": "Based on a true story, Ka'iulani (Q'orianka Kilcher) was Hawaiian royalty who was sent to school in Britain where she fell for a young Englishman, but when foreigners threaten her homeland, she must choose between love and her duty to her people.",
    "duration": 5820
}, {
    "movieLink": "https://www.hmnow.com/films/reasons-of-the-heart",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/10fb421b52931087b334e6a766af7fa1.jpg?width=502",
    "synopsis": "After Maggie Livingston (Terry Farrell) loses her beloved adopted mother, she decides to act on her curiosity about her biological parents and return to the small town of her birth.",
    "duration": 5520
}, {
    "movieLink": "https://www.hmnow.com/films/redwoodcurtain",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/b3a0b085312071f28d91f60337088ed8.jpg?width=502",
    "synopsis": "Geri (Lea Salonga) is a Vietnamese teenager who was adopted by a wealthy family, but when her adoptive father suddenly dies, she goes off searching for her biological father (Jeff Daniels), a veteran living in seclusion in the forest.",
    "duration": 5940
}, {
    "movieLink": "https://www.hmnow.com/films/remember_sunday",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/d8ea079b1bd14157f5a12927eee78718.jpg?width=502",
    "synopsis": "Molly (Alexis Bledel), a lonely waitress, meets the handsome, quirky Gus (Zachary Levi), only to find out that after a brain aneurysm he is incapable of forming any new memories.",
    "duration": 5820
}, {
    "movieLink": "https://www.hmnow.com/films/ridingbussis",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/d250062552a88049598164c3f247e950.jpg?width=502",
    "synopsis": "A New York fashion photographer (Andie MacDowell) returns home to be with her mentally challenged sister (Rosie O'Donnell) after the death of their father and finds she has much to learn about life and love.",
    "duration": 5880
}, {
    "movieLink": "https://www.hmnow.com/films/ring_the_bell",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/00182a92e1fa4345de625325b06cadc8.jpg?width=502",
    "synopsis": "Rob (Ryan Scharoun), a fast-talking sports agent, travels to a small town in hopes of convincing a high school baseball star to skip college for the big league, but getting to know the kid and the townsfolk makes him re-examine his values and outlook on life.",
    "duration": 5820
}, {
    "movieLink": "https://www.hmnow.com/films/rose-hill",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/c84a492e3932966505358e410e0d6cf6.jpg?width=502",
    "synopsis": "Raised on a ranch in the Old West by her four brothers, a young woman named Mary Rose (Jennifer Garner) learns a secret about her past that threatens to destroy the family.",
    "duration": 5940
}, {
    "movieLink": "https://www.hmnow.com/films/runaway_romance",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/c4c1f365c49f032869bdc00807ee84cc.jpg?width=502",
    "synopsis": "Reality TV star Ann Stanway (Danielle C. Ryan) gets booted off her show and ends up stranded in Amish country, so she takes refuge in the local inn where handsome architect Hunter (Trevor Donovan) makes her question if she really wants a life in front of the cameras.",
    "duration": 5280
}, {
    "movieLink": "https://www.hmnow.com/films/sandra_browns_white_hot",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/46122799aea37a45a6b6880084046354.jpg?width=502",
    "synopsis": "Sayre (Shenae Grimes-Beech) returns to her Louisiana hometown for her brother's funeral, where she clashes with her shady father Huff (John Schneider) and teams up with his attorney Beck (Sean Faris) in order to prove that someone murdered her brother.",
    "duration": 5220
}, {
    "movieLink": "https://www.hmnow.com/films/santa_baby",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/fc750faa4a73b23a0a68a95595d43df4.jpg?width=502",
    "synopsis": "Mary (Jenny McCarthy), the daughter of Santa Claus (George Wendt), returns to the North Pole after her dad gets sick and starts to reform the family business with her modern, fast-paced ways.",
    "duration": 5400
}, {
    "movieLink": "https://www.hmnow.com/films/saving_westbrook_high",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/7efe63ba8ae6b273d95a33b72c96d6e5.jpg?width=502",
    "synopsis": "Manny Cortez (Esai Morales) fulfilled his dream to buy a house where his girls could go to school where his father was a legendary coach, only to learn the school is being shut down, so he teams with the principal and teachers to keep the doors open.",
    "duration": 5220
}, {
    "movieLink": "https://www.hmnow.com/films/scattered_dreams_messenger",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/677fca1cc862ec7218bc32476144e5eb.jpg?width=502",
    "synopsis": "Based on the true story of Kathryn Messenger (Tyne Daly) and her husband George (Gerald McRaney) who were wrongly convicted and sent to prison, leaving their daughter Phyllis (Alicia Silverstone) to care for their younger children.",
    "duration": 5580
}, {
    "movieLink": "https://www.hmnow.com/films/scent_of_murder",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/ae078d85d0f7cd15982cb9e3ed0d5c50.jpg?width=502",
    "synopsis": "Brenna Scott (Sherilyn Fenn) trains dogs for search and rescue teams, and after she and her faithful companion save a kidnapped girl from a river, she realizes that a serial killer is on the loose.",
    "duration": 5100
}, {
    "movieLink": "https://www.hmnow.com/films/scents_and_sensibility",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/f21811075a10931d68a5a86924372206.jpg?width=502",
    "synopsis": "A modern take on Jane Austen where two well-to-do sisters (Ashley Williams and Marla Sokoloff) learn their family fortune has vanished, so they work together to create a new business as they both find themselves charmed by new men in their lives.",
    "duration": 5340
}, {
    "movieLink": "https://www.hmnow.com/films/seasons-of-the-heart",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/1f3afdab517428fa518863d27f66610b.jpg?width=502",
    "synopsis": "Vivian (Carol Burnett), a high-powered career woman who recently married her longtime love Ezra (George Segal), is suddenly forced to take in her 7-year-old grandson after the child is abandoned by his addict mother.",
    "duration": 5580
}, {
    "movieLink": "https://www.hmnow.com/films/secrets",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/c423182a64204c0bfa1d0b459f5d5440.jpg?width=502",
    "synopsis": "In 1910, Etta Berter (Veronica Hamel) discovers her servant girl has an illegitimate baby, so she fires the girl and takes the child to raise as her own, but Etta's elaborate web of lies eventually comes crashing down around her.",
    "duration": 5520
}, {
    "movieLink": "https://www.hmnow.com/films/see_jane_date",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/ac1a601abc7ade607f6a2b45e083e889.jpg?width=502",
    "synopsis": "Jane (Charisma Carpenter) makes up a fake boyfriend to impress her old high school friend, but when she's expected to bring her beau to a wedding, she has to go on a series of blind dates to find a guy who fits the bill.",
    "duration": 5160
}, {
    "movieLink": "https://www.hmnow.com/films/shadow_island_wedding_for_one",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/580bfd8b22b4653a5eb4ce2af977c40b.jpg?width=502",
    "synopsis": "Claire La Foret (Jennifer Finnigan) is supposed to be the maid of honor for her friend's wedding, but she gets called back to detective duty when the groom disappears.",
    "duration": 5520
}, {
    "movieLink": "https://www.hmnow.com/films/signed_sealed_delivered_movie",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/88d1ec00aa8cf90f2137baf300778ae2.jpg?width=502",
    "synopsis": "Shane McInerney (Kristin Booth) joins the Dead Letter Office of the U.S. Postal Service, where dedicated leader Oliver O'Toole (Eric Mabius) and his team work to reunite a young couple who spent one day together and then were kept apart by tragic circumstances.",
    "duration": 5160
}, {
    "movieLink": "https://www.hmnow.com/films/sleepless_in_seattle",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/96bd74a7d053efade005762508c6087e.jpg?width=502",
    "synopsis": "When Annie (Meg Ryan) hears Sam (Tom Hanks) on the radio talk about losing his wife, she writes a letter offering to cross the country to meet him at the top of the Empire State Building.",
    "duration": 6120
}, {
    "movieLink": "https://www.hmnow.com/films/smart_cookies",
    "imgLink": "",
    "synopsis": "Successful realtor Julie Sterling (Jessalyn Gilsig) signs up for community service and finds herself troop leader for a group of outcast Girl Scouts, and becomes determined to win her troop top honors.",
    "duration": 5160
}, {
    "movieLink": "https://www.hmnow.com/films/smooch",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/7ad26f9529c371d47100a453be5830b9.jpg?width=502",
    "synopsis": "Percy (Simon Kassianides) is a real-life prince set for an arranged marriage until he loses his memory and ends up as the nanny for a fairytale-obsessed girl (Kiernan Shipka) while falling for her mother, Gwen (Kellie Martin).",
    "duration": 5220
}, {
    "movieLink": "https://www.hmnow.com/films/standing_up",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/33fe163b027a8060534d717ee9375ec2.jpg?width=502",
    "synopsis": "Howie (Chandler Canterbury) and Grace (Annalise Basso) are two outcast kids at a summer camp who are bullied and left out in the wild as a cruel prank, so they team up and decide to run off together to avoid more torment.",
    "duration": 5580
}, {
    "movieLink": "https://www.hmnow.com/films/surviving_love",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/54cf6f89dccdcfa1552ba50340420af2.jpg?width=502",
    "synopsis": "A divorcing couple (real-life spouses Ted Danson and Mary Steenburgen) take one last road trip to work out their separation, but the old sparks start to fly again.",
    "duration": 5040
}, {
    "movieLink": "https://www.hmnow.com/films/susies_hope",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/85b3085ce6534044a1ba36762b67c769.jpg?width=502",
    "synopsis": "A survivor of a pit bull attack, Donna Lawrence (Emmanuelle Vaugier), adopts a pit bull puppy, Susie, that has been abused, and together they lead a historic effort to seek justice and protection for all animals.",
    "duration": 6240
}, {
    "movieLink": "https://www.hmnow.com/films/sweet_home_carolina",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/d319f343505f9b8d3c2496d8f92fc388.jpg?width=502",
    "synopsis": "Diane (Heather McComb) is a single mother who has had enough of the West Coast rat race when she learns she has inherited a house in her hometown, so she packs up her two daughters and heads back to South Carolina for a fresh start.",
    "duration": 5040
}, {
    "movieLink": "https://www.hmnow.com/films/sweet_nothing_in_my_ear",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/70c29f9a6d4f68cc78c484fba9042b2b.jpg?width=502",
    "synopsis": "Laura (Marlee Matlin), a deaf woman, and her husband Dan (Jeff Daniels), find their love at a crossroads when they split over whether to provide their son with implants that could restore his hearing.",
    "duration": 5580
}, {
    "movieLink": "https://www.hmnow.com/films/note_2_taking_a_chance_on_love",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/e3f4b6fa1bb6a6c885c08c24bf850d27.jpg?width=502",
    "synopsis": "Peyton MacGruder (Genie Francis) is adjusting to her new life when her boyfriend Kingston (Ted McGinley) proposes, but when she gets a heartfelt letter from a fan of her column, it inspires her to form a new friendship with a woman who has insight on overcoming fears and following your heart.",
    "duration": 5280
}, {
    "movieLink": "https://www.hmnow.com/films/attic_hiding_of_anne_frank",
    "imgLink": "",
    "synopsis": "After the Nazis invade Amsterdam, Otto Frank (Paul Scofield) turns to his assistant Miep Gies (Mary Steenburgen) to help hide him and his family, including his daughter Anne, in the attic above their offices.",
    "duration": 5880
}, {
    "movieLink": "https://www.hmnow.com/films/the_beautiful_beast",
    "imgLink": "",
    "synopsis": "Isabelle (Shona Kay), a spoiled socialite, gets lost in the mountains of Switzerland and takes shelter in a cabin where she encounters a reclusive American (Brad Johnson) who might be able to tame her beastly heart.",
    "duration": 5820
}, {
    "movieLink": "https://www.hmnow.com/films/the_best_bad_thing",
    "imgLink": "",
    "synopsis": "During the Great Depression, 12-year-old Rinko is sent by her mother to work on Mrs. Hata's cucumber farm, where she befriends an immigrant man, Mr. Yamanaka (George Takei) who lives in the barn.",
    "duration": 5340
}, {
    "movieLink": "https://www.hmnow.com/films/blackship",
    "imgLink": "",
    "synopsis": "Facing the end of his life, Declan returns to the seaside Irish village of his youth to spend his last days with his grandmother (Angela Lansbury), mother (Diane Wiest), and sister (Gina McKee).",
    "duration": 5820
}, {
    "movieLink": "https://www.hmnow.com/films/the_bouquet",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/2e39b89d4e2d0e4387af1c9b5f496430.jpg?width=502",
    "synopsis": "Terri (Kristy Swanson) and her sister have grown distant from each other and their parents' flower shop, but when tragedy strikes they have to set aside their differences and come together for the good of the family.",
    "duration": 5400
}, {
    "movieLink": "https://www.hmnow.com/films/the_boy_she_met_online",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/f003605b73924f4aada226f05c9aa402.jpg?width=502",
    "synopsis": "Cami (Tracy Spiridakos) is a high school student who meets Jake (Jon Cor) through social media and falls in love, not knowing that he is really college-aged and has only ever told her lies.",
    "duration": 5580
}, {
    "movieLink": "https://www.hmnow.com/films/boysnextdoor",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/9fe2e5ae67071309716b613277df086b.jpg?width=502",
    "synopsis": "With his marriage on the line, a social worker (Tony Goldwyn) who supervises a household of mentally challenged men struggles to balance his job with his neglected personal life.",
    "duration": 5940
}, {
    "movieLink": "https://www.hmnow.com/films/the_bridge",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/538fd2a6b781e3b21c39b9f9ad90ab9e.jpg?width=502",
    "synopsis": "Inspired by a true story, Isobel (Saskia Reeves), an Englishwoman caring for her three daughters at a seaside retreat, becomes the muse for the acclaimed artist Phillip Wilson Steer (David O'Hara).",
    "duration": 5820
}, {
    "movieLink": "https://www.hmnow.com/films/the_chateau_meroux",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/6543d4aae22ec42948795f90ca82bdae.jpg?width=502",
    "synopsis": "Wendy (Marla Sokoloff) inherits her late father's winery -- along with all the problems that go with it -- and she ends up falling for Chris (Barry Watson), the son of her biggest competitor.",
    "duration": 4920
}, {
    "movieLink": "https://www.hmnow.com/films/the_circuit",
    "imgLink": "",
    "synopsis": "Kylie Shines (Michelle Trachtenberg) is an up-and-coming racing sensation, and her spot on a new team puts her in direct competition with both her estranged father (Billy Campbell) and the young hotshot (Drew Fuller) she's dating.",
    "duration": 5340
}, {
    "movieLink": "https://www.hmnow.com/films/the_colt",
    "imgLink": "",
    "synopsis": "In the midst of the Civil War, Union soldier Jim (Ryan Merriman) finds hope when his trusty mare gives birth to a foal, but when the horses are stolen by Confederate troops, Jim sets off to recover them. Contains historical violence.",
    "duration": 5040
}, {
    "movieLink": "https://www.hmnow.com/films/irenasendler",
    "imgLink": "",
    "synopsis": "The inspirational true story of a social worker (Anna Paquin) who risked her life to sneak Jewish children out of the Warsaw Ghetto to save them from the Nazis.",
    "duration": 5760
}, {
    "movieLink": "https://www.hmnow.com/films/the_dempsey_sisters",
    "imgLink": "",
    "synopsis": "When Deena (Denyce Lawton) is fired from her job, she gets inspired to recruit her two younger sisters Sheena (Teairra Mari) and Tina (Cymphonique Miller) to rekindle their musical aspirations, and give their big brother a boost in his career as a talent manager.",
    "duration": 5280
}, {
    "movieLink": "https://www.hmnow.com/films/echoofthunder",
    "imgLink": "",
    "synopsis": "Gladwyn (Judy Davis) is raising her three children with her husband Larry (Jamey Sheridan) on a palm farm in the Australian outback when their lives are upended by the arrival of his 15-year-old daughter from Larry's first marriage.",
    "duration": 5940
}, {
    "movieLink": "https://www.hmnow.com/films/the_engagement_ring",
    "imgLink": "",
    "synopsis": "When a ring was lost decades ago, it created a rift between two Italian families, but now one adult daughter (Patricia Heaton) tries to patch things up so she can buy a vineyard.",
    "duration": 5400
}, {
    "movieLink": "https://www.hmnow.com/films/the_fathers_love",
    "imgLink": "",
    "synopsis": "Sarah (Angela Lin) is a single woman in New York City who thinks she's found the perfect guy in Reece (Erik McKay), until she learns a devastating truth that makes her question everything she thought she knew about love and forgiveness.",
    "duration": 4920
}, {
    "movieLink": "https://www.hmnow.com/films/flamingorising",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/43f0074b3c9db62d4498e6acec9447a3.jpg?width=502",
    "synopsis": "Hubert T. Lee (Brian Benben), a Vietnam veteran, moves his wife Edna (Elizabeth McGovern) and children to Florida where he plans to build the world's largest drive-in theater directly across the street from a quiet funeral parlor run by Turner Knight (William Hurt).",
    "duration": 5820
}, {
    "movieLink": "https://www.hmnow.com/films/four_feathers",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/441987d3c46b356e8d689ddb46fc76b1.jpg?width=502",
    "synopsis": "When Lt. Faversham (Beau Bridges) refuses to go to war, his best friends and his fiancee (Jane Seymour) declare him to be a coward, sending four white feathers to mark his dishonor.",
    "duration": 6000
}, {
    "movieLink": "https://www.hmnow.com/films/gambler_girl_and_gunslinger",
    "imgLink": "",
    "synopsis": "Charming card sharp Shea McCall (Dean Cain) lucks into sharing ownership of a ranch with cowboy B.J. Stoker (James Tupper), and the two find themselves at odds over control of the ranch and the affections of the neighboring widow, Liz Calhoun (Allison Hossack).",
    "duration": 5220
}, {
    "movieLink": "https://www.hmnow.com/films/the_incident",
    "imgLink": "",
    "synopsis": "A small Colorado town in 1944 is the site of a camp for German prisoners of war, and when the local doctor is murdered, attorney Harmon J. Cobb (Walter Matthau) is assigned to defend the soldier accused of the crime.",
    "duration": 5940
}, {
    "movieLink": "https://www.hmnow.com/films/cater_street_hangman",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/8353596ac8f61f5d18962568b95fa5cf.jpg?width=502",
    "synopsis": "Scotland Yard inspector Thomas Pitt (Eoin McCarthy) partners with upper-class society lady Charlotte Ellison (Keeley Hawes) to hunt down the killer who has been roaming the streets around her family's estate.",
    "duration": 6000
}, {
    "movieLink": "https://www.hmnow.com/films/the_last_dance",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/0ee45b70dceda4253fec40bc88222039.jpg?width=502",
    "synopsis": "After a retired Latin teacher (Maureen O'Hara) falls ill, she is taken to the hospital where her nurse is a former student (Eric Stoltz), and she regales him with stories of her first love, a soldier on leave from WWII.",
    "duration": 5400
}, {
    "movieLink": "https://www.hmnow.com/films/the-locket",
    "imgLink": "",
    "synopsis": "Distraught by the death of his mother, a young man takes a job at a nursing home and begins an unexpected, life-changing friendship with one of the patients (Vanessa Redgrave).",
    "duration": 5940
}, {
    "movieLink": "https://www.hmnow.com/films/the_long_way_home",
    "imgLink": "",
    "synopsis": "After the death of his wife, Tom Gerrin (Jack Lemmon) meets Leane Bossert (Sarah Paulson), a 21-year-old free spirit, and the unlikely pair decide to hitchhike across the country together.",
    "duration": 5460
}, {
    "movieLink": "https://www.hmnow.com/films/lost-child",
    "imgLink": "",
    "synopsis": "Based on a true story. After the deaths of her Jewish adoptive parents, Rebecca Hoffman (Mercedes Ruehl) goes in search of her birthplace and discovers her Navajo roots.",
    "duration": 5880
}, {
    "movieLink": "https://www.hmnow.com/films/lostvalentine",
    "imgLink": "",
    "synopsis": "Susan (Jennifer Love Hewitt), a TV journalist, learns the story of Caroline (Betty White), a widowed woman who lost her husband in WWII and still makes a yearly pilgrimage to honor his sacrifice.",
    "duration": 5760
}, {
    "movieLink": "https://www.hmnow.com/films/loveletter",
    "imgLink": "",
    "synopsis": "After finding an old love letter hidden in an antique desk, Scott (Campbell Scott) begins a magical correspondence with the poet (Jennifer Jason Leigh) who wrote it back in 1863.",
    "duration": 6000
}, {
    "movieLink": "https://www.hmnow.com/films/the_love_letter",
    "imgLink": "",
    "synopsis": "Advice columnist Parker (Keshia Knight Pulliam) thinks her best friend Aaron has gotten engaged to a woman who is wrong for him, so she anonymously writes a letter to her own column to try to set him straight, and opening herself up to new feelings in the process.",
    "duration": 5220
}, {
    "movieLink": "https://www.hmnow.com/films/magicdays",
    "imgLink": "",
    "synopsis": "After becoming pregnant out of wedlock in the 1940s, a young woman (Keri Russell) is thrown out of the house and forced into an arranged marriage with a lonely farmer (Skeet Ulrich).",
    "duration": 5940
}, {
    "movieLink": "https://www.hmnow.com/films/the_makeover",
    "imgLink": "",
    "synopsis": "When Hannah (Julia Stiles), an uptight congressional candidate, fails to connect with voters, she coaches Elliot (David Walton), a likable delivery guy, to be her political pawn.",
    "duration": 5760
}, {
    "movieLink": "https://www.hmnow.com/films/maldonado-miracle",
    "imgLink": "",
    "synopsis": "Jose, an 11-year-old from Mexico, arrives in a sleepy California town looking for his lost father, and when he takes refuge in a church, a misunderstanding leads the parishioners to believe a miracle has taken place, despite the skepticism of Father Russell (Peter Fonda).",
    "duration": 5760
}, {
    "movieLink": "https://www.hmnow.com/films/the_memory_book",
    "imgLink": "",
    "synopsis": "At a flea market, Chloe (Meghan Ory), a budding photographer, finds a book of pictures showcasing a young couple from the early '70s, so she sets out with the friendly Gabe (Luke Macfarlane) to track them down and prove love is real.",
    "duration": 5040
}, {
    "movieLink": "https://www.hmnow.com/films/the_mighty_macs",
    "imgLink": "",
    "synopsis": "The true story of Cathy Rush (played by Carla Gugino), the pioneering women's basketball coach who shook up a small Catholic college and led their team to the championship.",
    "duration": 5940
}, {
    "movieLink": "https://www.hmnow.com/films/the_moving_of_sophia_myles",
    "imgLink": "",
    "synopsis": "After her minister husband passes away, Sophia (Della Reese) locks horns with local real estate magnate Mary Margaret (Rue McClanahan), who wants the widow out of her house.",
    "duration": 5640
}, {
    "movieLink": "https://www.hmnow.com/films/the_music_teacher",
    "imgLink": "",
    "synopsis": "Alyson Daley (Annie Potts) is a dedicated educator who used music to help her get through the tragic loss of her husband and son, so when the school board threatens to end the music program, the students she touched reunite to save her job.",
    "duration": 5220
}, {
    "movieLink": "https://www.hmnow.com/films/mystery_cruise",
    "imgLink": "",
    "synopsis": "Lottery winner Alvirah (Gail O'Grady) and her best friend Regan (Michelle Harrison), a private eye, depart on a cruise with Regan's mystery author mother, but the role-playing game they're playing turns real when they deduce that there is an actual killer on board with them.",
    "duration": 4980
}, {
    "movieLink": "https://www.hmnow.com/films/the_national_tree",
    "imgLink": "",
    "synopsis": "Teenager Rock (Evan Williams) has his tree chosen for the honor of standing in front of the White House, but that means he and his father Corey (Andrew McCarthy) will have to put aside their differences and drive the tree across the country together.",
    "duration": 5340
}, {
    "movieLink": "https://www.hmnow.com/films/the_note",
    "imgLink": "",
    "synopsis": "Columnist Peyton MacGruder (Genie Francis) discovers a note presumably written by a victim in a plane crash addressed only to \"T.\", so she enlists sports reporter Kingston Danville (Ted McGinley) to help her track down the intended recipient, which also makes her re-examine her own past.",
    "duration": 5220
}, {
    "movieLink": "https://www.hmnow.com/films/the_perfect_summer",
    "imgLink": "",
    "synopsis": "After losing his dad, teenage Jake (Adam Horner) moves with his mom from Chicago to live with his grandfather (Eric Roberts) near the beach, where he learns how to surf, how to stand up for himself, and how to move on.",
    "duration": 4860
}, {
    "movieLink": "https://www.hmnow.com/films/the_perfect_wave",
    "imgLink": "",
    "synopsis": "Inspired by a true story, Ian (Scott Eastwood) is a surfer travelling the world in search of excitement until a near-fatal accident changes his perspective on life.",
    "duration": 5460
}, {
    "movieLink": "https://www.hmnow.com/films/pianolesson",
    "imgLink": "",
    "synopsis": "Based on the Pulitzer Prize-winning play, Boy Willie, (Charles S. Dutton), an African-American man in the 1930s, and his sister Berniece (Alfre Woodard) are divided over what to do with their heirloom piano.",
    "duration": 6000
}, {
    "movieLink": "https://www.hmnow.com/films/ranger_cook_and_hole_in_sky",
    "imgLink": "",
    "synopsis": "In the wilds of Montana in 1919, a 17-year-old recruit (Jerry O'Connell) is taught the ropes of protecting the forest by a legendary ranger, Bill Bell (Sam Elliott). Based on the story from the author of \"A River Runs Through It.\"",
    "duration": 5580
}, {
    "movieLink": "https://www.hmnow.com/films/reality_of_love",
    "imgLink": "",
    "synopsis": "Todd (Bradley Cooper) convinces his pal Ryan (Jason Priestley) to be the bachelor on a TV dating show, but then Todd falls for the bachelorette (Emma Caufield) that Ryan has already chosen.",
    "duration": 5400
}, {
    "movieLink": "https://www.hmnow.com/films/return-of-the-native",
    "imgLink": "",
    "synopsis": "Bored of life in the country, Eustacia (Catherine Zeta Jones) agrees to marry Clym (Ray Stevenson) and escape to Paris, but her passion for Damon (Clive Owen) could ruin them all.",
    "duration": 6000
}, {
    "movieLink": "https://www.hmnow.com/films/runaway",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/3ef36ae034e84ef5e90c441e6eefcc2c.jpg?width=502",
    "synopsis": "In a small Georgia town in the 1940s, two boys make a discovery that leads the town's new sheriff, Frank Richards (Dean Cain), to reopen the investigation of a trio of unsolved murders that the townsfolk would rather keep buried.",
    "duration": 5940
}, {
    "movieLink": "https://www.hmnow.com/films/russellgirl",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/9d5dfb3de1508edede4d2e130ddec3d3.jpg?width=502",
    "synopsis": "Still racked with guilt over a past tragedy, Sarah Russell (Amber Tamblyn), a college graduate and medical school hopeful, returns home to confront the past.",
    "duration": 5040
}, {
    "movieLink": "https://www.hmnow.com/films/the_secret",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/7c8fc23a2bd8902ec91d713f929e58d6.jpg?width=502",
    "synopsis": "Mike Dunmore (Kirk Douglas) is a popular store owner in a picturesque New England town who has been keeping something secret that he never learned to read or write, but when his grandson is found to also have a learning disability, the two will help each other.",
    "duration": 5520
}, {
    "movieLink": "https://www.hmnow.com/films/sevenstream",
    "imgLink": "",
    "synopsis": "Irish fisherman Owen Quinn (Scott Glenn) is still mourning his late wife when he comes to the aid of Mairead (Saffron Burrows), a beautiful and mysterious woman who brings new life to Owen and his sleepy town.",
    "duration": 5820
}, {
    "movieLink": "https://www.hmnow.com/films/the_staircase",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/9b0e700d0437c4e39691577a5190571b.jpg?width=502",
    "synopsis": "Mother Madalyn (Barbara Hershey) has prayed for someone to fix her broken-down New Mexico church, then one day a mysterious carpenter (William Petersen) arrives in town.",
    "duration": 5760
}, {
    "movieLink": "https://www.hmnow.com/films/the_storyteller",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/6a2ed350c0a53394ae2b087785e855cc.jpg?width=502",
    "synopsis": "WORLD PREMIERE: When a young girl who calls herself Abby (Brooklyn Rae Silzer) shows up from out of nowhere in the hospital room of an aging woman, she is taken in by the woman's family and helps bring joy and music back into their lives.",
    "duration": 5340
}, {
    "movieLink": "https://www.hmnow.com/films/summerofbentyler",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/d08044748b77f372a276f39ad673b672.jpg?width=502",
    "synopsis": "In the rural South during WWII, an attorney (James Woods) running for office creates a stir when he and his wife (Elizabeth McGovern) fulfill a dying woman's request to take in a disabled, African-American boy.",
    "duration": 5940
}, {
    "movieLink": "https://www.hmnow.com/films/the_triumph",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/a1cef1a2110b6b14484ebfe197bb69eb.jpg?width=502",
    "synopsis": "Based on the true story of Ron Clark (played by Matthew Perry), a teacher from small-town Virginia who moves to New York to work at an inner-city elementary school and challenge his students to succeed.",
    "duration": 5460
}, {
    "movieLink": "https://www.hmnow.com/films/the_ultimate_gift",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/740ebdc7a489b19d0dc77e5371029fbb.jpg?width=502",
    "synopsis": "Jason (Drew Fuller), a spoiled young man, goes to the reading of the will of his wealthy grandfather (James Garner) expecting to get rich, but instead receives a list of 12 tasks he must complete to learn how to care about other people.",
    "duration": 7020
}, {
    "movieLink": "https://www.hmnow.com/films/the_ultimate_legacy",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/68054811fed912998fc6a16653a13671.jpg?width=502",
    "synopsis": "Sally May (Raquel Welch) knows she doesn't have much time left, so she summons her estranged, angry grandson to their family estate and assigns him 12 steps to finish over the course of the year to earn his inheritance.",
    "duration": 5940
}, {
    "movieLink": "https://www.hmnow.com/films/the_ultimate_life",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/777404a827308accf15cab37e415ab71.jpg?width=502",
    "synopsis": "Jason (Logan Bartholomew) is trying to run his charitable foundation, but he is fighting off a legal battle from some ungrateful relatives, so he consults with his late grandfather's journal to learn how he faced adversity without losing his faith.",
    "duration": 6540
}, {
    "movieLink": "https://www.hmnow.com/films/valleylight",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/bc0b6515cbb5b4ca5d38fd51cc09b42b.jpg?width=502",
    "synopsis": "Noah Locke (Chris Klein), a veteran of World War II, wanders the rural roads of North Carolina in search of a place to belong and develops a close bond with Eleanor (Gretchen Mol), a young widow.",
    "duration": 5820
}, {
    "movieLink": "https://www.hmnow.com/films/waterwide",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/63768666cf2cf54cec15430e2594b9a6.jpg?width=502",
    "synopsis": "A young teacher (Jeff Hephner) is determined to bring education and inspiration to an impoverished African-American community in 1960s South Carolina, based on the memoir by Pat Conroy.",
    "duration": 6060
}, {
    "movieLink": "https://www.hmnow.com/films/watsons_go_to_birmingham",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/ec797fc26159a19ac327fcbc3f9217bd.jpg?width=502",
    "synopsis": "In the '60s, Wilona (Anika Noni Rose) convinces her husband Daniel (Wood Harris) to take their family from Flint, MI to her hometown in Alabama, not realizing they will be witnesses to the early days of the civil rights movement.",
    "duration": 5160
}, {
    "movieLink": "https://www.hmnow.com/films/the_way_home",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/c096fe1aed912ec0141933a3ae17b84e.jpg?width=502",
    "synopsis": "Based on the true story, Randy (Dean Cain) and Christal (Lori Beth Sikes) are parents in a desperate search for their missing 2-year-old with the help of their community which banded together to help reunite them.",
    "duration": 5400
}, {
    "movieLink": "https://www.hmnow.com/films/the_wedding_chapel",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/ca3f6663f4f0b533aa250dfcf10cb615.jpg?width=502",
    "synopsis": "Sarah (Emmanuelle Vaugier), a frustrated, freshly single artist, is recruited by her mother (Shelley Long) to help preserve her small town's historic church with the assistance of a handsome local lawyer.",
    "duration": 5460
}, {
    "movieLink": "https://www.hmnow.com/films/the_wedding_dress",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/fb3eaeca1e5c68cc60d1a32fa0b703d4.jpg?width=502",
    "synopsis": "Travis (Neil Patrick Harris) hopes his bride-to-be will wear the wedding dress his great aunt never got to use during WWII, but fate has different plans for him and five other couples.",
    "duration": 5280
}, {
    "movieLink": "https://www.hmnow.com/films/west_side_waltz",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/6854b6ba9e024437d68b124251a17817.jpg?width=502",
    "synopsis": "Margaret (Shirley MacLaine) is a widow who avoids everyone except her neighbor Cara (Liza Minnelli), but when she can no longer get by on her own, she hires an aspiring actress (Jennifer Grey) to be her live-in help.",
    "duration": 5400
}, {
    "movieLink": "https://www.hmnow.com/films/the_wild_girl",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/e694b02fb9b4de08f00e977506cb74f4.jpg?width=502",
    "synopsis": "During the 1932 Great Apache Expedition, news photographer Ned Giles (Brian Austin Green) is tasked with taking a lost girl named Chideh (Lola Tash) back to her people to exchange for a boy they are holding captive.",
    "duration": 5160
}, {
    "movieLink": "https://www.hmnow.com/films/the_wishing_tree",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/11fcc84bf67edbecc3b17a05b2d578b1.jpg?width=502",
    "synopsis": "Attorney Clara Collier (Alfre Woodard) returns to her Savannah, Georgia hometown after her mother passes away, and discovers a mute man (Blair Underwood) living by himself in the woods who needs her help.",
    "duration": 5760
}, {
    "movieLink": "https://www.hmnow.com/films/this_cant_be_love",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/7a9647ce633688cbbc80e8ea63986705.jpg?width=502",
    "synopsis": "Movie stars Marion Bennett (Katharine Hepburn) and Michael Reyman (Anthony Quinn) had a whirlwind romance back in the day, and now her young assistant (Jason Bateman) and his literary agent (Jami Gertz) team up to bring them back together.",
    "duration": 5340
}, {
    "movieLink": "https://www.hmnow.com/films/christmas_miracle",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/ab1b9978e945694bef4c7b6af118f2ab.jpg?width=502",
    "synopsis": "When a snow storm blocks all the roads, eight troubled people have to take shelter in an abandoned church on Christmas Eve where they find they all have more in common than they could have ever imagined.",
    "duration": 5520
}, {
    "movieLink": "https://www.hmnow.com/films/three_wise_women",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/e3cfea13928a2d24ba8b611804eee0eb.jpg?width=502",
    "synopsis": "Liz (Amy Huberman) stopped believing in love as a girl and is now set to marry a man who is all wrong for her, so her guardian angel Tom (Hugh O'Conor) makes her face her younger and older self to stop her from making a huge mistake.",
    "duration": 5280
}, {
    "movieLink": "https://www.hmnow.com/films/time_after_time",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/6795e3e7aae3ea7bde5eb810914b8745.jpg?width=502",
    "synopsis": "Richard (Kaj-Erik Eriksen) returns to his Long Island hometown for a fresh start and encounters Dick (Richard Thomas) -- the older version of himself from the future -- who is there to help him reconnect with his long-lost love, Jackie (Christine Chatelain).",
    "duration": 5160
}, {
    "movieLink": "https://www.hmnow.com/films/to_dance_with_olivia",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/4b5f70163604edd9431a4a896e8e694f.jpg?width=502",
    "synopsis": "In 1961, attorney Daniel Stewart (Louis Gossett Jr.) is asked to defend a farmer accused of accidentally shooting the young son of a powerful congressman, but the case opens up the emotional wounds left by the death of Daniels son years before.",
    "duration": 5460
}, {
    "movieLink": "https://www.hmnow.com/films/dancedog",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/e2ad7812222ce8e49223a2b7a2b8e3c2.jpg?width=502",
    "synopsis": "After his beloved wife (Jessica Tandy) of fifty years suddenly dies, a grieving widower (Hume Cronyn) finds an unlikely companion in a stray dog.",
    "duration": 6060
}, {
    "movieLink": "https://www.hmnow.com/films/to_live_for",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/da175cbc2e2f01351294645919d74744.jpg?width=502",
    "synopsis": "(AKA \"My Last Love\") Susan (Nancy Travis), a lawyer and single mother, learns she has cancer, so she moves with her daughter Carson back to her childhood hometown in California, where she meets an attractive waiter and tries to plan for Carson's future without her.",
    "duration": 5700
}, {
    "movieLink": "https://www.hmnow.com/films/undercover_angel",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/5cbd73f48669f53adfef29d75530a6f4.jpg?width=502",
    "synopsis": "Harrison (Dean Winters) is a frustrated writer who gets asked by his ex to watch her 6-year-old daughter Jenny, and she decides to play cupid and help him win over the beautiful woman (Yasmine Bleeth) from his favorite coffee place.",
    "duration": 5520
}, {
    "movieLink": "https://www.hmnow.com/films/unlikely_angel",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/1746942306d948ae9248f8281c7e88e4.jpg?width=502",
    "synopsis": "Fast-living singer Ruby Diamond (Dolly Parton) finds herself at the Pearly Gates only to learn she can't quite get in, so she's sent back to Earth with five days to help out a widower and his kids embrace the true spirit of Christmas.",
    "duration": 5520
}, {
    "movieLink": "https://www.hmnow.com/films/uphill_battle",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/dcda38e83ae013203d9ea96372b9c4f2.jpg?width=502",
    "synopsis": "After a heartbreaking divorce, single mom Erica (Shelby Smith) struggles to keep her teenage kids on the right path, but when she picks up cycling as a hobby, she finds a renewed sense of purpose and a second chance at love.",
    "duration": 5520
}, {
    "movieLink": "https://www.hmnow.com/films/walt_before_mickey",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/ed6796e1220fe6ae951d3e4d68e1d8a8.jpg?width=502",
    "synopsis": "The story of the early days of Walt Disney (played by Thomas Ian Nicholas), from his first company in Kansas City that ended in bankruptcy, to his partnership with his brother Roy (Jon Heder) that lead to his most beloved creation.",
    "duration": 6420
}, {
    "movieLink": "https://www.hmnow.com/films/war_flowers",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/95a880ba368eb7cc4e2bd42a2ab2b2f0.jpg?width=502",
    "synopsis": "During the Civil War, Sarabeth (Christina Ricci) is caring for her daughter and her home while her husband is away fighting for the Confederacy, until they find an injured Union soldier seeking shelter in their cellar.",
    "duration": 5880
}, {
    "movieLink": "https://www.hmnow.com/films/welcome_home",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/3f58e0223804435bac9430f84e0a66bb.jpg?width=502",
    "synopsis": "A writer (Luke Perry), desperate for a new idea, returns home to discover a homeless woman and her two children living in his house, giving him a new purpose in his life.",
    "duration": 5100
}, {
    "movieLink": "https://www.hmnow.com/films/deafman",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/cd37b50a93110ef822c8e63eef327a81.jpg?width=502",
    "synopsis": "Sammy was separated from his mother at age 10 and stopped talking, leading people to believe he couldn't hear, but as an adult (played by Matthew Modine) he learns a secret that could affect his adopted hometown.",
    "duration": 5880
}, {
    "movieLink": "https://www.hmnow.com/films/when_calls_the_heart",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/903805d5407abcd1a329fbc525a624a0.jpg?width=502",
    "synopsis": "As Elizabeth Thatcher (Poppy Drayton) ventures out west for her new teaching job in Coal Valley, she reads the journal of her Aunt Elizabeth (Maggie Grace), who first braved the wilds to teach there and met Wynn (Stephen Amell), a handsome Mountie.",
    "duration": 5220
}, {
    "movieLink": "https://www.hmnow.com/films/loiswilson",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/d2ee8f8736f22e7ae053ed661b54a102.jpg?width=502",
    "synopsis": "Based on the true story of the troubled, yet enduring love of Alcoholics Anonymous co-founder Bill Wilson (Barry Pepper) and his wife, Lois (Winona Ryder), who co-founded Al-Anon for families of alcoholics in 1951.",
    "duration": 5760
}, {
    "movieLink": "https://www.hmnow.com/films/wheres_the_love",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/8fb6265b8105778375cfca2a88079cc1.jpg?width=502",
    "synopsis": "Sebastian (Lamman Rucker) and Ryan (Denise Boutte) are a married couple who host a TV show where they help those with relationship trouble, but off-screen their own union is on the rocks, and when the secret gets out they have to decide if they can take their own advice.",
    "duration": 5280
}, {
    "movieLink": "https://www.hmnow.com/films/while_you_were_dating",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/b0ecbe384b63fe8e7c29fcdc54a36167.jpg?width=502",
    "synopsis": "Nick (Billy Baldwin) and Julia (Stefanie von Pfetten) start chatting anonymously online, and when they meet up, they realize they've been talking to their ex-spouse the whole time, so they try setting each other up with friends, but then they find their old spark hasn't gone out yet.",
    "duration": 5040
}, {
    "movieLink": "https://www.hmnow.com/films/william_and_catherine",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/a2501164b19d4f3266d6d13d39b75aa9.jpg?width=502",
    "synopsis": "Prince William (Dan Amboyer) and Kate Middleton (Alice St. Clair) were just friends at college, but after they got closer -- and she met his family -- they found themselves at the center of one of the most celebrated weddings in history.",
    "duration": 5220
}, {
    "movieLink": "https://www.hmnow.com/films/wings_of_the_wind",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/aeba400b721f3f0a6c21f48f7619b228.jpg?width=502",
    "synopsis": "Rose (Nicole Mauck), a headstrong young woman in 1946, begins to question her faith after being abandoned by her mother and nearly losing her own life while pursuing her passion for flying planes.",
    "duration": 7140
}, {
    "movieLink": "https://www.hmnow.com/films/wuthering_heights",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/bfef5d03ec715ba54620125df47ee68d.jpg?width=502",
    "synopsis": "Based on Emily Bronte's tragic romance, Heathcliffe (Robert Cavanah) falls for his adopted sister Cathy (Orla Brady), but when a tragedy forces her to marry another man, he becomes obsessed with vengeance against those who wronged him.",
    "duration": 6780
}, {
    "movieLink": "https://www.hmnow.com/films/youre_so_cupid",
    "imgLink": "https://d2eqr2grgdk9bg.cloudfront.net/v3/image/4cf70d753cc3bf9d02da74462cb8767b.jpg?width=502",
    "synopsis": "Emma and Lily, teenage twin sisters, face two romantic challenges: how to handle it when they both are interested in the same guy, and how to bring their feuding parents (Lauren Holly and Brian Krause) back together again.",
    "duration": 5520
}]